
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · OpenTelemetry 可观测性的未来</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="【著】Ted Young，【译】Jimmy Song（宋净超）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="history.html" />
    
    
    <link rel="prev" href="./" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to/" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="history.html">
            
                <a href="history.html">
            
                    
                    第 1 章：可观测性的历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="the-value-of-structured-data.html">
            
                <a href="the-value-of-structured-data.html">
            
                    
                    第 2 章：结构化数据的价值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="the-limitations-of-automated-analysis.html">
            
                <a href="the-limitations-of-automated-analysis.html">
            
                    
                    第 3 章：自动分析的局限性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="supporting-open-source-and-native-instrumentation.html">
            
                <a href="supporting-open-source-and-native-instrumentation.html">
            
                    
                    第 4 章：支持开源和原生监测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="architectural-overview.html">
            
                <a href="architectural-overview.html">
            
                    
                    第 5 章：OpenTelemetry 架构概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="stability-and-long-term-support.html">
            
                <a href="stability-and-long-term-support.html">
            
                    
                    第 6 章：稳定和长期支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="suggested-setups-and-telemetry-pipelines.html">
            
                <a href="suggested-setups-and-telemetry-pipelines.html">
            
                    
                    第 7 章：建议的设置和遥测管道
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="roll-out.html">
            
                <a href="roll-out.html">
            
                    
                    第 8 章：如何在组织中推广 OpenTelemetry
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="organization.html">
            
                <a href="organization.html">
            
                    
                    附录 A：OpenTelemetry 项目组织
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="roadmap.html">
            
                <a href="roadmap.html">
            
                    
                    附录 B：OpenTelemetry 项目路线图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6A21;&#x5F0F;&#x53C8;&#x4E00;&#x6B21;&#x6539;&#x53D8;&#x4E86;&#x3002;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x516C;&#x6709;&#x4E91;&#x4F9B;&#x5E94;&#x5546;&#x5DF2;&#x7ECF;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6539;&#x53D8;&#x4E86;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x8F6F;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6709;&#x4E86;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x7F16;&#x7801;&#x3002;&#x800C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x516C;&#x6709;&#x4E91;&#x4F9B;&#x5E94;&#x5546;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x77ED;&#x77ED;&#x51E0;&#x5929;&#x751A;&#x81F3;&#x51E0;&#x5C0F;&#x65F6;&#x5185;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x90E8;&#x7F72;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x64CD;&#x4F5C;&#x548C;&#x7EF4;&#x62A4;&#x5B83;&#x4EEC;&#x4E5F;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x66F4;&#x52A0;&#x5F02;&#x8D28;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x66F4;&#x52A0;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x770B;&#x6E05;&#x5927;&#x5C40;&#xFF0C;&#x4EE5;&#x53CA;&#x51C6;&#x786E;&#x5730;&#x6307;&#x51FA;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x4F46;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF1A;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x8FD0;&#x7EF4;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x80FD;&#x591F;&#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x7406;&#x89E3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4E8B;&#x52A1;&#x6709;&#x4E00;&#x4E2A;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x8861;&#x91CF;&#x548C;&#x8BF4;&#x660E;&#x5728;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8D44;&#x6E90;&#x662F;&#x5982;&#x4F55;&#x88AB;&#x6D88;&#x8017;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5BF9;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x9700;&#x6C42;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x65BD;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x65B9;&#x5F0F;&#x5FC5;&#x987B;&#x6539;&#x53D8;&#x3002;&#x672C;&#x62A5;&#x544A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x5173;&#x4E8E;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x4F20;&#x7EDF;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x5BF9;&#x73B0;&#x4EE3;&#x5E94;&#x7528;&#x7684;&#x4E0D;&#x8DB3;&#xFF1A;&#x7EE7;&#x7EED;&#x5C06;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x4F5C;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x5DE5;&#x5177;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x4F5C;&#x4E3A; &quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot;&#xFF09;&#x6765;&#x5B9E;&#x65BD;&#xFF0C;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x4EE5;&#x53EF;&#x9760;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x73B0;&#x4EE3;&#x5E94;&#x7528;&#x3002;</p>
<p>OpenTelemetry &#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7EFC;&#x5408;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6536;&#x96C6;&#x6709;&#x5173;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x548C;&#x6027;&#x80FD;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5305;&#x62EC;&#x6307;&#x6807;&#x3001;&#x65E5;&#x5FD7;&#x548C;&#x8DDF;&#x8E2A;&#xFF0C;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x3002;&#x6B63;&#x5982;&#x672C;&#x62A5;&#x544A;&#x6240;&#x89E3;&#x91CA;&#x7684;&#xFF0C;OpenTelemetry &#x662F;&#x4E00;&#x79CD;&#x751F;&#x6210;&#x548C;&#x6536;&#x96C6;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E3A;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x7684;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;OpenTelemetry &#x662F;&#x4E13;&#x95E8;&#x4E3A;&#x8FD9;&#x4E9B;&#x5F00;&#x6E90;&#x7EC4;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x4E0E;&#x4F9B;&#x5E94;&#x5546;&#x7279;&#x5B9A;&#x7684;&#x4EEA;&#x8868;&#x4E0D;&#x540C;&#xFF0C;OpenTelemetry &#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5D4C;&#x5165;&#x5230;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F00;&#x6E90;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x6765;&#x6DFB;&#x52A0;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x4EEA;&#x8868;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x589E;&#x52A0;&#x4EFB;&#x4F55;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6216;&#x4F9B;&#x5E94;&#x5546;&#x7279;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>OpenTelemetry &#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x4E5F;&#x6709;&#x597D;&#x5904;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#xFF0C;&#x9065;&#x6D4B;&#x7684;&#x4EA7;&#x751F;&#x65B9;&#x5F0F;&#x4E0E;&#x5B83;&#x7684;&#x8BC4;&#x4F30;&#x3001;&#x5B58;&#x50A8;&#x548C;&#x5206;&#x6790;&#x65B9;&#x5F0F;&#x76F8;&#x8054;&#x7CFB;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5FC5;&#x987B;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x7684;&#x65E9;&#x671F;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E4B;&#x540E;&#x5F88;&#x96BE;&#x6539;&#x53D8;&#x3002;OpenTelemetry&#xFF08;&#x5C31;&#x50CF;&#x5B83;&#x7684;&#x524D;&#x8EAB; OpenTracing &#x548C; OpenCensus &#x4E00;&#x6837;&#xFF09;&#x5C06;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x9065;&#x6D4B;&#x7684;&#x65B9;&#x5F0F;&#x4E0E;&#x9065;&#x6D4B;&#x7684;&#x5206;&#x6790;&#x65B9;&#x5F0F;&#x76F8;&#x5206;&#x79BB;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x65B0;&#x6280;&#x672F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x8BE5;&#x6280;&#x672F;&#x5C06;&#x5982;&#x4F55;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5B83;&#x5C06;&#x5982;&#x4F55;&#x88AB;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x4EBA;&#x4F7F;&#x7528;&#x3002;&#x672C;&#x62A5;&#x544A;&#x63CF;&#x8FF0;&#x4E86; OpenTelemetry &#x5982;&#x4F55;&#x6EE1;&#x8DB3;&#x5E93;&#x4F5C;&#x8005;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x62E5;&#x6709;&#x8005;&#x3001;&#x8FD0;&#x7EF4;&#x548C;&#x54CD;&#x5E94;&#x8005;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x5982;&#x4F55;&#x4F7F;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x72EC;&#x7ACB;&#x5DE5;&#x4F5C; &#x2014;&#x2014; &#x5373;&#x81EA;&#x52A8;&#x505A;&#x51FA;&#x5173;&#x952E;&#x51B3;&#x5B9A;&#x5E76;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;OpenTelemetry &#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x548C;&#x64CD;&#x4F5C;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x9009;&#x62E9;&#x6700;&#x9002;&#x5408;&#x5176;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7EC4;&#x7EC7;&#x9700;&#x6C42;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5305;&#x62EC;&#x9700;&#x8981;&#x591A;&#x79CD;&#x5DE5;&#x5177;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5B83;&#x8FD8;&#x5305;&#x62EC;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x53CA;&#x9700;&#x8981;&#x65B0;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x6280;&#x672F;&#x7684;&#x6210;&#x719F;&#x548C;&#x7EC4;&#x7EC7;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x867D;&#x7136;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x81F4;&#x529B;&#x4E8E;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x6295;&#x8D44;&#x4E8E;&#x751F;&#x6210;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x65B9;&#x5F0F;&#x3002;&#x672C;&#x62A5;&#x544A;&#x5C55;&#x793A;&#x4E86; OpenTelemetry &#x662F;&#x5982;&#x4F55;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x8303;&#x56F4;&#x72ED;&#x7A84;&#x3001;&#x53EF;&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x4E14;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x88AB;&#x8981;&#x6C42;&#x8FDB;&#x884C;&#x8FD9;&#x79CD;&#x6295;&#x8D44;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x4F60;&#x6240;&#x671F;&#x671B;&#x7684;&#x3002;</p>
<p>&#x4E0E;&#x4EE5;&#x5F80;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x90FD;&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x4E8B;&#x540E;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x65E0;&#x6CD5;&#x4E86;&#x89E3;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x6B63;&#x5728;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x98CE;&#x9669;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x91C7;&#x53D6;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x6210;&#x672C;&#x4F1A;&#x9020;&#x6210;&#x4F60;&#x7684;&#x7EC4;&#x7EC7;&#x591A;&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x5728;&#x507F;&#x8FD8;&#x7684;&#x503A;&#x52A1;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x957F;&#x65F6;&#x95F4;&#x505C;&#x673A;&#xFF0C;&#x8FD8;&#x662F;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x88AB;&#x65E0;&#x4F11;&#x6B62;&#x7684;&#x4F9B;&#x5E94;&#x5546;&#x8FC1;&#x79FB;&#x6240;&#x56F0;&#x6270;&#xFF0C;&#x4F60;&#x7684;&#x7EC4;&#x7EC7;&#x7684;&#x6210;&#x529F;&#x90FD;&#x53D6;&#x51B3;&#x4E8E;&#x50CF; OpenTelemetry &#x8FD9;&#x6837;&#x7684;&#x96C6;&#x6210;&#x548C;&#x5F00;&#x653E;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x672C;&#x62A5;&#x544A;&#x63D0;&#x4F9B;&#x4E86;&#x5173;&#x4E8E;&#x5728;&#x4F60;&#x7684;&#x7EC4;&#x7EC7;&#x4E2D;&#x91C7;&#x7528;&#x548C;&#x7BA1;&#x7406; OpenTelemetry &#x7684;&#x5B9E;&#x7528;&#x5EFA;&#x8BAE;&#x3002;&#x5B83;&#x5C06;&#x4F7F;&#x4F60;&#x5F00;&#x59CB;&#x8D70;&#x5411;&#x6210;&#x529F;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5B9E;&#x8DF5;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x5E76;&#x91CA;&#x653E;&#x51FA;&#x4E91;&#x539F;&#x751F;&#x548C;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x7684;&#x8BB8;&#x591A;&#x771F;&#x6B63;&#x7684;&#x597D;&#x5904;&#xFF1A;&#x4F60;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x5EFA;&#x7ACB;&#x548C;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x53EF;&#x9760;&#x548C;&#x81EA;&#x4FE1;&#x5730;&#x8FD0;&#x884C;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x2014;&#x2014; Daniel &#x201C;Spoons&#x201D; Spoonhower Lightstep </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | &#x57FA;&#x4E8E; <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC 4.0 &#x534F;&#x8BAE;</a> &#x53D1;&#x5E03; | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-03-12 14:35:03
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 说明">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="history.html" class="navigation navigation-next " aria-label="Next page: 第 1 章：可观测性的历史">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.2","depth":1,"next":{"title":"第 1 章：可观测性的历史","level":"1.3","depth":1,"path":"history.md","ref":"history.md","articles":[]},"previous":{"title":"说明","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","lightbox","ga","sitemap-general","hide-element","insert-logo","adsense"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | 基于 <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC 4.0 协议</a> 发布 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/opentelemetry-obervability"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/opentelemetry-obervability/blob/main/"},"splitter":{},"adsense":{"client":"ca-pub-4029167986768912","slot":"2445941692","format":"auto","element":".page-inner section","position":"bottom"},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/opentelemetry-obervability/"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://jimmysong.io/images/logo-black-text.png"},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"【著】Ted Young，【译】Jimmy Song（宋净超）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"history.html#fig1.3.1","level":"1.3","list_caption":"Figure: 图 1-1：可观测性的 \"三大支柱\"。","alt":"图 1-1：可观测性的 \"三大支柱\"。","nro":1,"url":"images/f1-1.png","index":1,"caption_template":"_CAPTION_","label":"图 1-1：可观测性的 \"三大支柱\"。","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"history.html#fig1.3.2","level":"1.3","list_caption":"Figure: 图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","alt":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","nro":2,"url":"images/f1-2.png","index":2,"caption_template":"_CAPTION_","label":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"history.html#fig1.3.3","level":"1.3","list_caption":"Figure: 图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","alt":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","nro":3,"url":"images/f1-3.png","index":3,"caption_template":"_CAPTION_","label":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"history.html#fig1.3.4","level":"1.3","list_caption":"Figure: 图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","alt":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","nro":4,"url":"images/f1-4.png","index":4,"caption_template":"_CAPTION_","label":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"history.html#fig1.3.5","level":"1.3","list_caption":"Figure: 图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","alt":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","nro":5,"url":"images/f1-5.png","index":5,"caption_template":"_CAPTION_","label":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"the-value-of-structured-data.html#fig1.4.1","level":"1.4","list_caption":"Figure: 图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","alt":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","nro":6,"url":"images/f2-1.png","index":1,"caption_template":"_CAPTION_","label":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"the-value-of-structured-data.html#fig1.4.2","level":"1.4","list_caption":"Figure: 图 2-2：一个事务，被视为一组资源。","alt":"图 2-2：一个事务，被视为一组资源。","nro":7,"url":"images/f2-2.png","index":2,"caption_template":"_CAPTION_","label":"图 2-2：一个事务，被视为一组资源。","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"the-value-of-structured-data.html#fig1.4.3","level":"1.4","list_caption":"Figure: 图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","alt":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","nro":8,"url":"images/f2-3.png","index":3,"caption_template":"_CAPTION_","label":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","attributes":{},"skip":false,"key":"1.4.3"},{"backlink":"the-value-of-structured-data.html#fig1.4.4","level":"1.4","list_caption":"Figure: 图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","alt":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","nro":9,"url":"images/f2-4.png","index":4,"caption_template":"_CAPTION_","label":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","attributes":{},"skip":false,"key":"1.4.4"},{"backlink":"architectural-overview.html#fig1.7.1","level":"1.7","list_caption":"Figure: 图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","alt":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","nro":10,"url":"images/f5-1.png","index":1,"caption_template":"_CAPTION_","label":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","attributes":{},"skip":false,"key":"1.7.1"},{"backlink":"architectural-overview.html#fig1.7.2","level":"1.7","list_caption":"Figure: 图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","alt":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","nro":11,"url":"images/f5-2.png","index":2,"caption_template":"_CAPTION_","label":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","attributes":{},"skip":false,"key":"1.7.2"},{"backlink":"architectural-overview.html#fig1.7.3","level":"1.7","list_caption":"Figure: 图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","alt":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","nro":12,"url":"images/f5-3.png","index":3,"caption_template":"_CAPTION_","label":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","attributes":{},"skip":false,"key":"1.7.3"},{"backlink":"stability-and-long-term-support.html#fig1.8.1","level":"1.8","list_caption":"Figure: 图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","alt":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","nro":13,"url":"images/f6-1.png","index":1,"caption_template":"_CAPTION_","label":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","attributes":{},"skip":false,"key":"1.8.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.1","level":"1.9","list_caption":"Figure: 图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","alt":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","nro":14,"url":"images/f7-1.png","index":1,"caption_template":"_CAPTION_","label":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","attributes":{},"skip":false,"key":"1.9.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.2","level":"1.9","list_caption":"Figure: 图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","alt":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","nro":15,"url":"images/f7-2.png","index":2,"caption_template":"_CAPTION_","label":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","attributes":{},"skip":false,"key":"1.9.2"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.3","level":"1.9","list_caption":"Figure: 图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","alt":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","nro":16,"url":"images/f7-3.png","index":3,"caption_template":"_CAPTION_","label":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","attributes":{},"skip":false,"key":"1.9.3"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.4","level":"1.9","list_caption":"Figure: 图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","alt":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","nro":17,"url":"images/f7-4.png","index":4,"caption_template":"_CAPTION_","label":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","attributes":{},"skip":false,"key":"1.9.4"}]},"title":"OpenTelemetry 可观测性的未来","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生社区":"https://cloudnative.to/"}},"gitbook":"*","description":"OpenTelemetry 可观察性的未来 | O'Reilly 报告"},"file":{"path":"foreword.md","mtime":"2022-03-12T14:35:03.465Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-12T14:35:29.907Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-adsense/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

