
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第 1 章：可观测性的历史 · OpenTelemetry 可观测性的未来</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="【著】Ted Young，【译】Jimmy Song（宋净超）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="the-value-of-structured-data.html" />
    
    
    <link rel="prev" href="foreword.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/docs/" target="_blank" class="custom-link">云原生资料库</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="history.html">
            
                <a href="history.html">
            
                    
                    第 1 章：可观测性的历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="the-value-of-structured-data.html">
            
                <a href="the-value-of-structured-data.html">
            
                    
                    第 2 章：结构化数据的价值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="the-limitations-of-automated-analysis.html">
            
                <a href="the-limitations-of-automated-analysis.html">
            
                    
                    第 3 章：自动分析的局限性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="supporting-open-source-and-native-instrumentation.html">
            
                <a href="supporting-open-source-and-native-instrumentation.html">
            
                    
                    第 4 章：支持开源和原生监测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="architectural-overview.html">
            
                <a href="architectural-overview.html">
            
                    
                    第 5 章：OpenTelemetry 架构概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="stability-and-long-term-support.html">
            
                <a href="stability-and-long-term-support.html">
            
                    
                    第 6 章：稳定和长期支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="suggested-setups-and-telemetry-pipelines.html">
            
                <a href="suggested-setups-and-telemetry-pipelines.html">
            
                    
                    第 7 章：建议的设置和遥测管道
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="roll-out.html">
            
                <a href="roll-out.html">
            
                    
                    第 8 章：如何在组织中推广 OpenTelemetry
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="organization.html">
            
                <a href="organization.html">
            
                    
                    附录 A：OpenTelemetry 项目组织
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="roadmap.html">
            
                <a href="roadmap.html">
            
                    
                    附录 B：OpenTelemetry 项目路线图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第 1 章：可观测性的历史</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-1-&#x7AE0;&#xFF1A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x5386;&#x53F2;">&#x7B2C; 1 &#x7AE0;&#xFF1A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x5386;&#x53F2;</h1>
<p>&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x884C;&#x4E1A;&#x6B63;&#x5904;&#x5728;&#x5DE8;&#x53D8;&#x4E2D;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x7CFB;&#x7EDF;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x5957;&#x7B52;&#x4ED3;&#x5F0F;&#x7684;&#x3001;&#x72EC;&#x7ACB;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x5305;&#x542B;&#x7ED3;&#x6784;&#x4E0D;&#x826F;&#xFF08;&#x6216;&#x5B8C;&#x5168;&#x975E;&#x7ED3;&#x6784;&#x5316;&#xFF09;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x4E9B;&#x72EC;&#x7ACB;&#x7684;&#x5DE5;&#x5177;&#x4E5F;&#x662F;&#x5782;&#x76F4;&#x6574;&#x5408;&#x7684;&#x3002;&#x5DE5;&#x5177;&#x3001;&#x534F;&#x8BAE;&#x548C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x90FD;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x540E;&#x7AEF;&#x6216;&#x670D;&#x52A1;&#xFF0C;&#x4E0D;&#x80FD;&#x4E92;&#x6362;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x66F4;&#x6362;&#x6216;&#x91C7;&#x7528;&#x65B0;&#x7684;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#x6765;&#x66F4;&#x6362;&#x6574;&#x4E2A;&#x5DE5;&#x5177;&#x94FE;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x66F4;&#x6362;&#x540E;&#x7AEF;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5B64;&#x7ACB;&#x7684;&#x6280;&#x672F;&#x683C;&#x5C40;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684; &quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot;&#xFF1A;&#x65E5;&#x5FD7;&#x3001;&#x5EA6;&#x91CF;&#x548C;&#xFF08;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#xFF09;&#x8FFD;&#x8E2A;&#xFF08;&#x89C1;&#x56FE; 1-1&#xFF09;&#x3002;</p>
<p><strong>&#x65E5;&#x5FD7;</strong></p>
<p>&#x8BB0;&#x5F55;&#x6784;&#x6210;&#x4E8B;&#x52A1;&#x7684;&#x5404;&#x4E2A;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><strong>&#x5EA6;&#x91CF;</strong></p>
<p>&#x8BB0;&#x5F55;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<p><strong>&#x8FFD;&#x8E2A;</strong></p>
<p>&#x6D4B;&#x91CF;&#x64CD;&#x4F5C;&#x7684;&#x5EF6;&#x8FDF;&#x548C;&#x8BC6;&#x522B;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6027;&#x80FD;&#x74F6;&#x9888;&#xFF0C;&#x6216;&#x8005;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#x5E76;&#x4E0D;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x8FFD;&#x8E2A;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x4E0D;&#x719F;&#x6089;&#x5B83;&#x3002;</p>
<figure id="fig1.3.1"><a href="images/f1-1.png" data-lightbox="68eb4d30-dd9f-4ebf-8cb1-a297ba2126c2" data-title="&#x56FE; 1-1&#xFF1A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684; " 三大支柱"。"=""><img src="images/f1-1.png" alt="&#x56FE; 1-1&#xFF1A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684; " 三大支柱"。"=""></a><figcaption>&#x56FE; 1-1&#xFF1A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684; &quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot;&#x3002;</figcaption></figure>
<p>&#x6211;&#x4EEC;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5DE5;&#x4F5C;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x4EE5;&#x81F4;&#x4E8E;&#x6211;&#x4EEC;&#x4E0D;&#x5E38;&#x8D28;&#x7591;&#x5B83;&#x3002;&#x4F46;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;&quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot; &#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x65B9;&#x6CD5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x53EA;&#x662F;&#x63CF;&#x8FF0;&#x4E86;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x78B0;&#x5DE7;&#x88AB;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x63A9;&#x76D6;&#x4E86;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x7684;&#x51E0;&#x4E2A;&#x57FA;&#x672C;&#x4E8B;&#x5B9E;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x4E8B;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x4E8B;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#xFF1F;</h2>
<p>&#x5728;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x4E0D;&#x540C;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x8303;&#x5F0F;&#x7684;&#x5229;&#x5F0A;&#x4E4B;&#x524D;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x6240;&#x89C2;&#x5BDF;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x4EEC;&#x6700;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x662F;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF1A;<strong>&#x4E8B;&#x52A1;</strong>&#x548C;<strong>&#x8D44;&#x6E90;</strong>&#x3002;</p>
<p><strong>&#x4E8B;&#x52A1;&#xFF08;transaction&#xFF09;</strong>&#x4EE3;&#x8868;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x6240;&#x6709;&#x52A8;&#x4F5C;&#xFF0C;&#x4EE5;&#x4FBF;&#x670D;&#x52A1;&#x80FD;&#x591F;&#x505A;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x8D2D;&#x4E70;&#x4E00;&#x4E2A;&#x88C5;&#x6EE1;&#x7269;&#x54C1;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x8BA2;&#x8D2D;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x6C7D;&#x8F66;&#xFF1A;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E8B;&#x52A1;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x7406;&#x89E3;&#xFF0C;&#x4E8B;&#x52A1;<strong>&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;</strong>&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x3002;&#x5BF9;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x90FD;&#x662F;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x4ECE;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x53D1;&#x51FA; HTTP &#x8BF7;&#x6C42;&#x5F00;&#x59CB;&#x3002;&#x4EE3;&#x7406;&#x9996;&#x5148;&#x5411;&#x8BA4;&#x8BC1;&#x7CFB;&#x7EDF;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x4EE5;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x7ED9;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5411;&#x5404;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x548C;&#x540E;&#x7AEF;&#x7CFB;&#x7EDF;&#x53D1;&#x51FA;&#x82E5;&#x5E72;&#x8BF7;&#x6C42;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#xFF1A;Kafka &#x6216; AMQP&#xFF0C;&#x88AB;&#x7528;&#x6765;&#x6392;&#x961F;&#x7B49;&#x5F85;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x7684;&#x989D;&#x5916;&#x5DE5;&#x4F5C;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x90FD;&#x5FC5;&#x987B;&#x6B63;&#x786E;&#x5B8C;&#x6210;&#xFF0C;&#x4EE5;&#x4FBF;&#x5411;&#x6025;&#x5207;&#x7B49;&#x5F85;&#x7684;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x5931;&#x8D25;&#x6216;&#x8017;&#x65F6;&#x8FC7;&#x957F;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5168;&#x9762;&#x7406;&#x89E3;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x4E00;&#x8DEF;&#x4E0B;&#x6765;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x90FD;&#x5728;&#x6D88;&#x8017;<strong>&#x8D44;&#x6E90;&#xFF08;resource&#xFF09;</strong>&#x3002;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x5E76;&#x53D1;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x4EEC;&#x7684;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x4E0B;&#x964D;&#x5E76;&#x5F00;&#x59CB;&#x5931;&#x6548;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x6269;&#x5927;&#x89C4;&#x6A21;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0E;&#x53EF;&#x80FD;&#x8C03;&#x7528;&#x9501;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E92;&#x52A8;&#xFF0C;&#x9020;&#x6210;&#x74F6;&#x9888;&#x3002;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x8BB0;&#x5F55;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x4F1A;&#x963B;&#x788D;&#x66F4;&#x65B0;&#x8BE5;&#x8BB0;&#x5F55;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x90FD;&#x662F;&#x8981;&#x82B1;&#x94B1;&#x7684;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x6708;&#x7684;&#x6708;&#x5E95;&#xFF0C;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4F9B;&#x5E94;&#x5546;&#x4F1A;&#x7ED9;&#x4F60;&#x53D1;&#x8D26;&#x5355;&#x3002;&#x4F60;&#x6D88;&#x8017;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x7684;&#x8D26;&#x5355;&#x5C31;&#x8D8A;&#x957F;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x6216;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#xFF1F;&#x8981;&#x4E48;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4FEE;&#x6539;&#x4E8B;&#x52A1;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x4FEE;&#x6539;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x9B54;&#x9B3C;&#x5C31;&#x5728;&#x7EC6;&#x8282;&#x4E2D;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x7AE0;&#x5C06;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5DE5;&#x5177;&#x8868;&#x793A;&#x4E8B;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#x7684;&#x7406;&#x60F3;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x63CF;&#x8FF0;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x505A;&#x7684;&#x975E;&#x7406;&#x60F3;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<blockquote>
<p><strong>&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x4E8B;&#x52A1;</strong></p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x9664;&#x4E86;&#x8DE8;&#x4E8B;&#x52A1;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x684C;&#x9762;&#x548C;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x662F;&#x57FA;&#x4E8E;<strong>&#x53CD;&#x5E94;&#x5668;&#xFF08;reactor&#xFF09;</strong>&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x8FDE;&#x7EED;&#x4E92;&#x52A8;&#x3002;&#x7167;&#x7247;&#x7F16;&#x8F91;&#x548C;&#x89C6;&#x9891;&#x6E38;&#x620F;&#x5C31;&#x662F;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x6709;&#x5F88;&#x957F;&#x7684;&#x7528;&#x6237;&#x4F1A;&#x8BDD;&#xFF0C;&#x5F88;&#x96BE;&#x63CF;&#x8FF0;&#x4E3A;&#x79BB;&#x6563;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5DE5;&#x5177;&#xFF0C;&#x5982;<strong>&#x771F;&#x5B9E;&#x7528;&#x6237;&#x76D1;&#x63A7;</strong>&#xFF08;RUM&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x5206;&#x5E03;&#x5F0F;&#x8FFD;&#x8E2A;&#xFF0C;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x7684;&#x7528;&#x6237;&#x4F1A;&#x8BDD;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x670D;&#x52A1;&#x90FD;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4E8B;&#x52A1;&#x6A21;&#x5F0F;&#x4E0A;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x662F;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x89C2;&#x5BDF;&#x4E8B;&#x52A1;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x9644;&#x5F55; B &#x4E2D;&#x5BF9; RUM &#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
</blockquote>
<h2 id="&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x4E09;&#x5927;&#x652F;&#x67F1;">&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x4E09;&#x5927;&#x652F;&#x67F1;</h2>
<p>&#x8003;&#x8651;&#x5230;&#x4E8B;&#x52A1;&#x548C;&#x8D44;&#x6E90;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4E09;&#x5927;&#x652F;&#x67F1;&#x6A21;&#x5F0F;&#x3002;&#x5C06;&#x8FD9;&#x79CD;&#x5173;&#x6CE8;&#x70B9;&#x7684;&#x5206;&#x79BB;&#x6807;&#x8BB0;&#x4E3A; &quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x662F;&#x6709;&#x610F;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x660E;&#x667A;&#x7684;&#x3002;&#x652F;&#x67F1;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x4E25;&#x8083;&#xFF0C;&#x5C31;&#x50CF;&#x53E4;&#x4EE3;&#x96C5;&#x5178;&#x7684;&#x5E15;&#x7279;&#x519C;&#x795E;&#x5E99;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x5B89;&#x6392;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x5916;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7531;&#x591A;&#x4E2A;&#x5B64;&#x7ACB;&#x7684;&#x3001;&#x5782;&#x76F4;&#x6574;&#x5408;&#x7684;&#x5DE5;&#x5177;&#x94FE;&#x7EC4;&#x6210;&#xFF0C;&#x5176;&#x771F;&#x6B63;&#x7684;&#x539F;&#x56E0;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x5EB8;&#x7684;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x60F3;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x6240;&#x4EE5;&#x4ED6;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5DE5;&#x5177;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x5305;&#x542B;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x6D88;&#x606F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5C06;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x548C;&#x68C0;&#x7D22;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x7684;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x8DB3;&#x591F;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x60F3;&#x76D1;&#x6D4B;&#x5728;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x65F6;&#x523B;&#x4F7F;&#x7528;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF1B;&#x4ED6;&#x60F3;&#x6355;&#x6349;&#x6307;&#x6807;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4ED6;&#x4E0D;&#x4F1A;&#x4E3A;&#x6B64;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#xFF0C;&#x5BF9;&#x5417;&#xFF1F;&#x4ED6;&#x60F3;&#x8FFD;&#x8E2A;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x662F;&#x5982;&#x4F55;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x5E76;&#x8DE8;&#x8D8A;&#x4E00;&#x7EC4;&#x6709;&#x9650;&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4E00;&#x5927;&#x5806;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x4E0E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x3001;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x7CFB;&#x7EDF;&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x751F;&#x6210;&#x3001;&#x4F20;&#x8F93;&#x548C;&#x5B58;&#x50A8;&#x5EA6;&#x91CF;&#x7684;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x60F3;&#x8981;&#x8BC6;&#x522B;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x7684;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6027;&#x8D28;&#x4F7F;&#x5B83;&#x53D8;&#x5F97;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x8BC6;&#x522B;&#x6027;&#x80FD;&#x74F6;&#x9888;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x8FDE;&#x4E32;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E8B;&#x52A1;&#x4E2D;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x5982;&#x4F55;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x3002;&#x7531;&#x4E8E;&#x65B0;&#x7684;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x53D6;&#x4EE3;&#x73B0;&#x6709;&#x7684;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x88AB;&#x5927;&#x91CF;&#x62BD;&#x6837;&#xFF0C;&#x4EE5;&#x9650;&#x5236;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x8FD0;&#x884C;&#x7B2C;&#x4E09;&#x4E2A;&#x53EF;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x96F6;&#x6572;&#x788E;&#x6253;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x65B9;&#x6CD5;&#x662F;&#x4EBA;&#x7C7B;&#x5DE5;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x81EA;&#x7136;&#x548C;&#x53EF;&#x7406;&#x89E3;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B83;&#x6709;&#x5176;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x5F80;&#x5F80;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x4F7F;&#x7528;&#xFF08;&#x548C;&#x7BA1;&#x7406;&#xFF09;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x76F8;&#x6096;&#x3002;</p>
<h2 id="&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x89C2;&#x5BDF;&#x7CFB;&#x7EDF;&#xFF1F;">&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x89C2;&#x5BDF;&#x7CFB;&#x7EDF;&#xFF1F;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5728;&#x8C03;&#x67E5;&#x95EE;&#x9898;&#x65F6;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x5B9E;&#x9645;&#x7684;&#x3001;&#x4E0D;&#x52A0;&#x4FEE;&#x9970;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x8C03;&#x67E5;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;&#x6CE8;&#x610F;&#x5230;&#x6709;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x5B9A;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x4E86;&#x5B83;&#x7684;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5DE5;&#x5177;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x5B64;&#x7ACB;&#x5730;&#x4F7F;&#x7528;&#x6BCF;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x5168;&#x90E8;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x800C;&#x5728;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x5B64;&#x7ACB;&#x6027;&#x7ED9;&#x64CD;&#x4F5C;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x6709;&#x4EBA;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6307;&#x6807;<strong>&#x53D8;&#x5F97;&#x6B6A;&#x4E03;&#x626D;&#x516B;&#x65F6;&#xFF0C;</strong>&#x8C03;&#x67E5;&#x5C31;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&quot;&#x6BDB;&#x523A;&quot; &#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x6240;&#x638C;&#x63E1;&#x7684;&#x552F;&#x4E00;&#x4FE1;&#x606F;&#x662F;&#x4EEA;&#x8868;&#x76D8;&#x4E0A;&#x4E00;&#x6761;&#x5C0F;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x5BF9;&#x8BE5;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x662F;&#x5426;&#x770B;&#x8D77;&#x6765; &quot;&#x6B63;&#x786E;&quot; &#x7684;&#x5185;&#x90E8;&#x8BC4;&#x4F30;&#xFF08;&#x56FE; 1-2&#xFF09;&#x3002;</p>
<figure id="fig1.3.2"><a href="images/f1-2.png" data-lightbox="58d5d398-f914-4715-bf7a-a1c71ecff61d" data-title="&#x56FE; 1-2&#xFF1A;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x5BFB;&#x627E;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x6027;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;"><img src="images/f1-2.png" alt="&#x56FE; 1-2&#xFF1A;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x5BFB;&#x627E;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x6027;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;"></a><figcaption>&#x56FE; 1-2&#xFF1A;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x5BFB;&#x627E;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x6027;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;</figcaption></figure>
<p>&#x5728;&#x786E;&#x5B9A;&#x4E86;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x5F00;&#x59CB;&#x770B;&#x8D77;&#x6765; &quot;&#x4E0D;&#x5BF9;&#x52B2;&quot; &#x7684;&#x90A3;&#x4E00;&#x70B9;&#x540E;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5C06;&#x772F;&#x8D77;&#x773C;&#x775B;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x4EEA;&#x8868;&#x677F;&#x4E0A;&#x540C;&#x65F6;&#x51FA;&#x73B0; &quot;&#x6BDB;&#x523A;&quot; &#x7684;&#x5176;&#x4ED6;&#x7EBF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x6307;&#x6807;&#x662F;&#x5B8C;&#x5168;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x4E2D;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x76EF;&#x7740;&#x56FE;&#x8868;&#xFF0C;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x548C;&#x8111;&#x529B;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4F1A;&#x5BFC;&#x81F4;&#x773C;&#x775B;&#x75B2;&#x52B3;&#x3002;</p>
<p>&#x5C31;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4F1A;&#x7528;&#x4E00;&#x628A;&#x5C3A;&#x5B50;&#x6216;&#x4E00;&#x5F20;&#x7EB8;&#xFF0C;&#x53EA;&#x770B;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x6392;&#x6210;&#x4E00;&#x6392;&#x3002;&#x5728; &quot;&#x73B0;&#x4EE3;&quot; &#x4EEA;&#x8868;&#x76D8;&#x4E2D;&#xFF0C;&#x6807;&#x5C3A;&#x73B0;&#x5728;&#x662F;&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x7ED8;&#x5236;&#x7684;&#x7EBF;&#x3002;&#x4F46;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7C97;&#x7565;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8BC6;&#x522B;&#x76F8;&#x5173;&#x6027;&#x7684;&#x771F;&#x6B63;&#x5DE5;&#x4F5C;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x53D1;&#x751F;&#x5728;&#x64CD;&#x4F5C;&#x8005;&#x7684;&#x5934;&#x8111;&#x4E2D;&#xFF0C;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x5728;&#x5BF9;&#x95EE;&#x9898;&#x6709;&#x4E86;&#x521D;&#x6B65;&#x7684;&#x3001;&#x7C97;&#x7565;&#x7684;&#x731C;&#x6D4B;&#x540E;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x901A;&#x5E38;&#x5F00;&#x59CB;&#x8C03;&#x67E5;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x53EF;&#x80FD;&#x4E0E;&#x95EE;&#x9898;&#x6709;&#x5173;&#x7684;&#x4E8B;&#x52A1;&#xFF08;&#x65E5;&#x5FD7;&#xFF09;&#x548C;&#x8D44;&#x6E90;&#xFF08;&#x673A;&#x5668;&#x3001;&#x8FDB;&#x7A0B;&#x3001;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF09;&#xFF08;&#x56FE; 1-3&#xFF09;&#x3002;</p>
<figure id="fig1.3.3"><a href="images/f1-3.png" data-lightbox="6f9990b4-f78f-4fca-9696-6dbc0a2f0212" data-title="&#x56FE; 1-3&#xFF1A;&#x627E;&#x5230;&#x4E0E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;"><img src="images/f1-3.png" alt="&#x56FE; 1-3&#xFF1A;&#x627E;&#x5230;&#x4E0E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;"></a><figcaption>&#x56FE; 1-3&#xFF1A;&#x627E;&#x5230;&#x4E0E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x7ECF;&#x5386;&#x3002;</figcaption></figure>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x65E5;&#x5FD7;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E0D;&#x80FD;&#x4E0E;&#x4EFB;&#x4F55;&#x6307;&#x6807;&#x4EEA;&#x8868;&#x677F;&#x81EA;&#x52A8;&#x5173;&#x8054;&#x3002;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x7684;&#x5177;&#x4F53;&#x4FE1;&#x606F;&#x901A;&#x5E38;<strong>&#x4E0D;&#x5728;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;</strong>&#x4E2D;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x901A;&#x8FC7; SSH &#x6216;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x8BBF;&#x95EE;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x673A;&#x5668;&#x6765;&#x67E5;&#x770B;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x518D;&#x6B21;&#x88AB;&#x7559;&#x4E0B;&#x5BFB;&#x627E;&#x76F8;&#x5173;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x5728;&#x6307;&#x6807;&#x548C;&#x76F8;&#x5173;&#x65E5;&#x5FD7;&#x4E4B;&#x95F4;&#x3002;&#x8BC6;&#x522B;&#x8FD9;&#x4E9B;&#x65E5;&#x5FD7;&#x53EF;&#x80FD;&#x5F88;&#x56F0;&#x96BE;&#xFF1B;&#x901A;&#x5E38;&#x5FC5;&#x987B;&#x67E5;&#x9605;&#x6E90;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x4E86;&#x89E3;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x5F53;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x5E0C;&#x671B;&#x662F;&#xFF09;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x901A;&#x5E38;&#x662F;&#x786E;&#x5B9A;&#x5BFC;&#x81F4;&#x8FD9;&#x4E2A;&#x65E5;&#x5FD7;&#x4EA7;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x94FE;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8981;&#x627E;&#x5230;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x7F3A;&#x4E4F;&#x5173;&#x8054;&#x6027;&#x7ED9;&#x64CD;&#x4F5C;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x548C;&#x534A;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x81EA;&#x52A8;&#x7D22;&#x5F15;&#x548C;&#x6309;&#x4E8B;&#x52A1;&#x8FC7;&#x6EE4;&#x65E5;&#x5FD7;&#x7684;&#x673A;&#x5236;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x662F;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x65E5;&#x5FD7;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x6267;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7279;&#x522B;&#x7684;&#x67E5;&#x8BE2;&#x548C;&#x8FC7;&#x6EE4;&#xFF0C;&#x5C06;&#x53EF;&#x7528;&#x7684;&#x65E5;&#x5FD7;&#x7B5B;&#x9009;&#x6210;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x4EE3;&#x8868;&#x4E8B;&#x52A1;&#x7684;&#x8FD1;&#x4F3C;&#x60C5;&#x51B5;&#x3002;&#x4E3A;&#x4E86;&#x6210;&#x529F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x4F9D;&#x9760;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x6DFB;&#x52A0;&#x5404;&#x79CD;&#x8BF7;&#x6C42; ID &#x548C;&#x8BB0;&#x5F55;&#xFF0C;&#x4EE5;&#x4FBF;&#x65E5;&#x540E;&#x627E;&#x5230;&#x5E76;&#x62FC;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x91CD;&#x5EFA;&#x4E8B;&#x52A1;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E4F;&#x5473;&#x7684;&#xFF0C;&#x4F46;&#x5374;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x7CFB;&#x7EDF;&#x53D1;&#x5C55;&#x5230;&#x5305;&#x62EC;&#x8BB8;&#x591A;&#x6A2A;&#x5411;&#x6269;&#x5C55;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x91CD;&#x5EFA;&#x4E8B;&#x52A1;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x5F00;&#x59CB;&#x4E25;&#x91CD;&#x9650;&#x5236;&#x4E86;&#x8C03;&#x67E5;&#x7684;&#x8303;&#x56F4;&#x3002;&#x56FE; 1-4 &#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6D89;&#x53CA;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#x7684;&#x590D;&#x6742;&#x4E8B;&#x52A1;&#x3002;&#x4F60;&#x5C06;&#x5982;&#x4F55;&#x6536;&#x96C6;&#x6240;&#x6709;&#x7684;&#x65E5;&#x5FD7;&#xFF1F;</p>
<figure id="fig1.3.4"><a href="images/f1-4.png" data-lightbox="50daeed6-687f-4c2f-ac3d-1dddc7fb1801" data-title="&#x56FE; 1-4&#xFF1A;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x627E;&#x5230;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8B;&#x52A1;&#x7684;&#x786E;&#x5207;&#x65E5;&#x5FD7;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x3002;"><img src="images/f1-4.png" alt="&#x56FE; 1-4&#xFF1A;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x627E;&#x5230;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8B;&#x52A1;&#x7684;&#x786E;&#x5207;&#x65E5;&#x5FD7;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x3002;"></a><figcaption>&#x56FE; 1-4&#xFF1A;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x627E;&#x5230;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8B;&#x52A1;&#x7684;&#x786E;&#x5207;&#x65E5;&#x5FD7;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x3002;</figcaption></figure>
<p><strong>&#x5206;&#x5E03;&#x5F0F;&#x8FFD;&#x8E2A;</strong>&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x62E5;&#x6709;&#x81EA;&#x52A8;&#x91CD;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709; ID &#x548C;&#x7D22;&#x5F15;&#x5DE5;&#x5177;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x7ECF;&#x5E38;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x7528;&#x4E8E;&#x8FDB;&#x884C;&#x5EF6;&#x8FDF;&#x5206;&#x6790;&#x7684;&#x5229;&#x57FA;&#x5DE5;&#x5177;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53D1;&#x9001;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x65E5;&#x5FD7;&#x6570;&#x636E;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x4E13;&#x6CE8;&#x4E8E;&#x5EF6;&#x8FDF;&#x5206;&#x6790;&#xFF0C;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x7ECF;&#x5E38;&#x88AB;&#x5927;&#x91CF;&#x91C7;&#x6837;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x4E0E;&#x8FD9;&#x7C7B;&#x8C03;&#x67E5;&#x65E0;&#x5173;&#x3002;</p>
<h2 id="&#x4E0D;&#x662F;&#x4E09;&#x6839;&#x67F1;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x80A1;&#x7EF3;&#x5B50;">&#x4E0D;&#x662F;&#x4E09;&#x6839;&#x67F1;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x80A1;&#x7EF3;&#x5B50;</h2>
<p>&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x5948;&#x4E4B;&#x4E3E;&#x3002;&#x4E0A;&#x8FF0;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x786E;&#x5B9E;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x6015;&#x7684;&#x72B6;&#x6001;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x4F53;&#x5236;&#x4E0B;&#x751F;&#x6D3B;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x6CA1;&#x6709;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x4E0E;&#x5B83;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x591A;&#x4E48;&#x4F4E;&#x6548;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;&#x4E3A;&#x4E86;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x6536;&#x96C6;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x6839;&#x636E;&#x4EEA;&#x8868;&#x76D8;&#x663E;&#x793A;&#x548C;&#x65E5;&#x5FD7;&#x626B;&#x63CF;&#x7B49;&#x89C6;&#x89C9;&#x53CD;&#x9988;&#xFF0C;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x5934;&#x8111;&#x6765;&#x8BC6;&#x522B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7D27;&#x5F20;&#x7684;&#x8111;&#x529B;&#x52B3;&#x52A8;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x626B;&#x63CF;&#x548C;&#x5173;&#x8054;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x8111;&#x529B;&#x52B3;&#x52A8;&#x5C31;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5982;&#x679C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x4E13;&#x6CE8;&#x4E8E;&#x8C03;&#x67E5;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x662F;<strong>&#x5982;&#x4F55;</strong>&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x9996;&#x5148;&#x786E;&#x5B9A;<strong>&#x4EC0;&#x4E48;</strong>&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x5C06;&#x8282;&#x7701;&#x5927;&#x91CF;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x51C6;&#x786E;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x5206;&#x6790;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#x90FD;&#x9700;&#x8981;&#x88AB;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x65E5;&#x5FD7;&#x9700;&#x8981;&#x88AB;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x4E8B;&#x52A1;&#x3002;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x9700;&#x8981;&#x4E0E;&#x65E5;&#x5FD7;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x6837;&#x4EA7;&#x751F;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x4E0E;&#x5B83;&#x4EEC;&#x6240;&#x6D4B;&#x91CF;&#x7684;&#x4E8B;&#x52A1;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x90FD;&#x9700;&#x8981;&#x4E0E;&#x5E95;&#x5C42;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90; &#x2014;&#x2014; &#x8F6F;&#x4EF6;&#x3001;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x914D;&#x7F6E;&#x7EC6;&#x8282;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x4EE5;&#x4FBF;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#x90FD;&#x80FD;&#x4E0E;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x76F8;&#x5173;&#x8054;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x3001;&#x53EF;&#x904D;&#x5386;&#x7684;&#x56FE;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x63CF;&#x8FF0;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5C06;&#x7ED9;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x89C6;&#x56FE;&#x3002;&#x4E0E;&#x5176;&#x8BF4;&#x662F;&#x4E0D;&#x76F8;&#x8FDE;&#x7684;&#x6570;&#x636E;&#x7684; &quot;&#x4E09;&#x6839;&#x652F;&#x67F1;&quot;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x636E;&#x7684;&#x4E00;&#x80A1;&#x7EF3;&#x5B50;&#x3002;</p>
<p>OpenTelemetry &#x56E0;&#x6B64;&#x8BDE;&#x751F;&#x3002;&#x5982;&#x56FE; 1-5 &#x6240;&#x793A;&#xFF0C;OpenTelemetry &#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9065;&#x6D4B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4EE5;&#x4E00;&#x79CD;&#x7EFC;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x751F;&#x6210;&#x8FFD;&#x8E2A;&#x3001;&#x65E5;&#x5FD7;&#x548C;&#x6307;&#x6807;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x636E;&#x70B9;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x534F;&#x8BAE;&#x4E00;&#x8D77;&#x4F20;&#x8F93;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<figure id="fig1.3.5"><a href="images/f1-5.png" data-lightbox="5ad93db0-74d9-4f36-bcee-8cc6cb233bb6" data-title="&#x56FE; 1-5&#xFF1A;OpenTelemetry &#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B64;&#x7ACB;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x3001;&#x9AD8;&#x5EA6;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x6570;&#x636E;&#x6D41;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;"><img src="images/f1-5.png" alt="&#x56FE; 1-5&#xFF1A;OpenTelemetry &#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B64;&#x7ACB;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x3001;&#x9AD8;&#x5EA6;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x6570;&#x636E;&#x6D41;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;"></a><figcaption>&#x56FE; 1-5&#xFF1A;OpenTelemetry &#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B64;&#x7ACB;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x3001;&#x9AD8;&#x5EA6;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x6570;&#x636E;&#x6D41;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</figcaption></figure>
<p>&#x8FD9;&#x79CD;&#x7EDF;&#x4E00;&#x7684;&#x6570;&#x636E;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#xFF1F;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x8FD9;&#x4E09;&#x4E2A;&#x652F;&#x67F1;&#x653E;&#x5728;&#x4E00;&#x8FB9;&#xFF0C;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | &#x57FA;&#x4E8E; <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC 4.0 &#x534F;&#x8BAE;</a> &#x53D1;&#x5E03; | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-09-17 02:39:27
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="foreword.html" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="the-value-of-structured-data.html" class="navigation navigation-next " aria-label="Next page: 第 2 章：结构化数据的价值">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第 1 章：可观测性的历史","level":"1.3","depth":1,"next":{"title":"第 2 章：结构化数据的价值","level":"1.4","depth":1,"path":"the-value-of-structured-data.md","ref":"the-value-of-structured-data.md","articles":[]},"previous":{"title":"前言","level":"1.2","depth":1,"path":"foreword.md","ref":"foreword.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","lightbox","ga","sitemap-general","hide-element","insert-logo","adsense"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | 基于 <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC 4.0 协议</a> 发布 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/opentelemetry-obervability"},"editlink":{"base":"https://github.com/rootsongjc/opentelemetry-obervability/blob/main/","label":"编辑本页"},"splitter":{},"adsense":{"client":"ca-pub-4029167986768912","slot":"2445941692","format":"auto","element":".page-inner section","position":"bottom"},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/opentelemetry-obervability/"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://jimmysong.io/images/logo-black-text.png"},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"【著】Ted Young，【译】Jimmy Song（宋净超）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"history.html#fig1.3.1","level":"1.3","list_caption":"Figure: 图 1-1：可观测性的 \"三大支柱\"。","alt":"图 1-1：可观测性的 \"三大支柱\"。","nro":1,"url":"images/f1-1.png","index":1,"caption_template":"_CAPTION_","label":"图 1-1：可观测性的 \"三大支柱\"。","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"history.html#fig1.3.2","level":"1.3","list_caption":"Figure: 图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","alt":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","nro":2,"url":"images/f1-2.png","index":2,"caption_template":"_CAPTION_","label":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"history.html#fig1.3.3","level":"1.3","list_caption":"Figure: 图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","alt":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","nro":3,"url":"images/f1-3.png","index":3,"caption_template":"_CAPTION_","label":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"history.html#fig1.3.4","level":"1.3","list_caption":"Figure: 图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","alt":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","nro":4,"url":"images/f1-4.png","index":4,"caption_template":"_CAPTION_","label":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"history.html#fig1.3.5","level":"1.3","list_caption":"Figure: 图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","alt":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","nro":5,"url":"images/f1-5.png","index":5,"caption_template":"_CAPTION_","label":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"the-value-of-structured-data.html#fig1.4.1","level":"1.4","list_caption":"Figure: 图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","alt":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","nro":6,"url":"images/f2-1.png","index":1,"caption_template":"_CAPTION_","label":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"the-value-of-structured-data.html#fig1.4.2","level":"1.4","list_caption":"Figure: 图 2-2：一个事务，被视为一组资源。","alt":"图 2-2：一个事务，被视为一组资源。","nro":7,"url":"images/f2-2.png","index":2,"caption_template":"_CAPTION_","label":"图 2-2：一个事务，被视为一组资源。","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"the-value-of-structured-data.html#fig1.4.3","level":"1.4","list_caption":"Figure: 图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","alt":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","nro":8,"url":"images/f2-3.png","index":3,"caption_template":"_CAPTION_","label":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","attributes":{},"skip":false,"key":"1.4.3"},{"backlink":"the-value-of-structured-data.html#fig1.4.4","level":"1.4","list_caption":"Figure: 图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","alt":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","nro":9,"url":"images/f2-4.png","index":4,"caption_template":"_CAPTION_","label":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","attributes":{},"skip":false,"key":"1.4.4"},{"backlink":"architectural-overview.html#fig1.7.1","level":"1.7","list_caption":"Figure: 图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","alt":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","nro":10,"url":"images/f5-1.png","index":1,"caption_template":"_CAPTION_","label":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","attributes":{},"skip":false,"key":"1.7.1"},{"backlink":"architectural-overview.html#fig1.7.2","level":"1.7","list_caption":"Figure: 图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","alt":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","nro":11,"url":"images/f5-2.png","index":2,"caption_template":"_CAPTION_","label":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","attributes":{},"skip":false,"key":"1.7.2"},{"backlink":"architectural-overview.html#fig1.7.3","level":"1.7","list_caption":"Figure: 图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","alt":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","nro":12,"url":"images/f5-3.png","index":3,"caption_template":"_CAPTION_","label":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","attributes":{},"skip":false,"key":"1.7.3"},{"backlink":"stability-and-long-term-support.html#fig1.8.1","level":"1.8","list_caption":"Figure: 图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","alt":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","nro":13,"url":"images/f6-1.png","index":1,"caption_template":"_CAPTION_","label":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","attributes":{},"skip":false,"key":"1.8.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.1","level":"1.9","list_caption":"Figure: 图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","alt":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","nro":14,"url":"images/f7-1.png","index":1,"caption_template":"_CAPTION_","label":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","attributes":{},"skip":false,"key":"1.9.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.2","level":"1.9","list_caption":"Figure: 图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","alt":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","nro":15,"url":"images/f7-2.png","index":2,"caption_template":"_CAPTION_","label":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","attributes":{},"skip":false,"key":"1.9.2"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.3","level":"1.9","list_caption":"Figure: 图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","alt":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","nro":16,"url":"images/f7-3.png","index":3,"caption_template":"_CAPTION_","label":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","attributes":{},"skip":false,"key":"1.9.3"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.4","level":"1.9","list_caption":"Figure: 图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","alt":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","nro":17,"url":"images/f7-4.png","index":4,"caption_template":"_CAPTION_","label":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","attributes":{},"skip":false,"key":"1.9.4"}]},"title":"OpenTelemetry 可观测性的未来","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生资料库":"https://jimmysong.io/docs/"}},"gitbook":"*","description":"OpenTelemetry 可观察性的未来 | O'Reilly 报告"},"file":{"path":"history.md","mtime":"2022-09-17T02:39:27.789Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-09-17T02:39:50.496Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-adsense/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

