
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第 6 章：稳定和长期支持 · OpenTelemetry 可观测性的未来</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="【著】Ted Young，【译】Jimmy Song（宋净超）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="suggested-setups-and-telemetry-pipelines.html" />
    
    
    <link rel="prev" href="architectural-overview.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to/" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="history.html">
            
                <a href="history.html">
            
                    
                    第 1 章：可观测性的历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="the-value-of-structured-data.html">
            
                <a href="the-value-of-structured-data.html">
            
                    
                    第 2 章：结构化数据的价值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="the-limitations-of-automated-analysis.html">
            
                <a href="the-limitations-of-automated-analysis.html">
            
                    
                    第 3 章：自动分析的局限性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="supporting-open-source-and-native-instrumentation.html">
            
                <a href="supporting-open-source-and-native-instrumentation.html">
            
                    
                    第 4 章：支持开源和原生监测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="architectural-overview.html">
            
                <a href="architectural-overview.html">
            
                    
                    第 5 章：OpenTelemetry 架构概述
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="stability-and-long-term-support.html">
            
                <a href="stability-and-long-term-support.html">
            
                    
                    第 6 章：稳定和长期支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="suggested-setups-and-telemetry-pipelines.html">
            
                <a href="suggested-setups-and-telemetry-pipelines.html">
            
                    
                    第 7 章：建议的设置和遥测管道
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="roll-out.html">
            
                <a href="roll-out.html">
            
                    
                    第 8 章：如何在组织中推广 OpenTelemetry
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="organization.html">
            
                <a href="organization.html">
            
                    
                    附录 A：OpenTelemetry 项目组织
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="roadmap.html">
            
                <a href="roadmap.html">
            
                    
                    附录 B：OpenTelemetry 项目路线图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第 6 章：稳定和长期支持</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-6-&#x7AE0;&#xFF1A;&#x7A33;&#x5B9A;&#x548C;&#x957F;&#x671F;&#x652F;&#x6301;">&#x7B2C; 6 &#x7AE0;&#xFF1A;&#x7A33;&#x5B9A;&#x548C;&#x957F;&#x671F;&#x652F;&#x6301;</h1>
<p>OpenTelemetry &#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x5141;&#x8BB8;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5E76;&#x5B58;&#x7684;&#x5C40;&#x9762;&#x3002;&#x5728; OpenTelemetry &#x4E2D;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x4FDD;&#x8BC1;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x4FE1;&#x53F7;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x3002;&#x4E0E;&#x5176;&#x770B;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x4E0D;&#x5982;&#x68C0;&#x67E5;&#x4F60;&#x60F3;&#x4F7F;&#x7528;&#x7684;&#x4FE1;&#x53F7;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x7B49;&#x7EA7;&#x3002;</p>
<h2 id="&#x4FE1;&#x53F7;&#x751F;&#x547D;&#x5468;&#x671F;">&#x4FE1;&#x53F7;&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<p>&#x56FE; 6-1 &#x663E;&#x793A;&#x4E86;&#x65B0;&#x4FE1;&#x53F7;&#x662F;&#x5982;&#x4F55;&#x88AB;&#x6DFB;&#x52A0;&#x5230; OpenTelemetry &#x7684;&#x3002;<strong>&#x5B9E;&#x9A8C;&#x6027;</strong>&#x4FE1;&#x53F7;&#x4ECD;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x6539;&#x53D8;&#x5E76;&#x7834;&#x574F;&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5B9E;&#x9A8C;&#x6027;&#x4FE1;&#x53F7;&#x7684;&#x5F00;&#x53D1;&#x662F;&#x4EE5;&#x89C4;&#x8303;&#x63D0;&#x6848;&#x7684;&#x5F62;&#x5F0F;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x4E0E;&#x4E00;&#x7EC4;&#x539F;&#x578B;&#x4E00;&#x8D77;&#x5F00;&#x53D1;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x5B9E;&#x9A8C;&#x6027;&#x4FE1;&#x53F7;&#x51C6;&#x5907;&#x597D;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x4FE1;&#x53F7;&#x7684;&#x7279;&#x6027;&#x5C31;&#x4F1A;&#x88AB;&#x51BB;&#x7ED3;&#xFF0C;&#x65B0;&#x4FE1;&#x53F7;&#x7684;&#x6D4B;&#x8BD5;&#x7248;&#x5C31;&#x4F1A;&#x4EE5;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x521B;&#x5EFA;&#x3002;&#x6D4B;&#x8BD5;&#x7248;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x7A81;&#x7834;&#x6027;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E3A;&#x65E9;&#x671F;&#x91C7;&#x7528;&#x8005;&#x7684;&#x4EA7;&#x54C1;&#x53CD;&#x9988;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x88AB;&#x8BA4;&#x4E3A;&#x53EF;&#x4EE5;&#x88AB;&#x5BA3;&#x5E03;&#x4E3A;<strong>&#x7A33;&#x5B9A;</strong>&#x7248;&#x672C;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x5E03;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x7248;&#x672C;&#x3002;&#x5982;&#x679C;&#x5019;&#x9009;&#x7248;&#x672C;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#xFF0C;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x4FE1;&#x53F7;&#x7684;&#x89C4;&#x8303;&#x548C;&#x6D4B;&#x8BD5;&#x7248;&#x90FD;&#x88AB;&#x5BA3;&#x5E03;&#x4E3A;&#x7A33;&#x5B9A;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x53D8;&#x5F97;&#x7A33;&#x5B9A;&#xFF0C;&#x5B83;&#x5C31;&#x5C5E;&#x4E8E; OpenTelemetry &#x7684;&#x957F;&#x671F;&#x652F;&#x6301;&#x4FDD;&#x969C;&#x8303;&#x56F4;&#x3002;OpenTelemetry &#x975E;&#x5E38;&#x91CD;&#x89C6;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x548C;&#x65E0;&#x7F1D;&#x5347;&#x7EA7;&#x3002;&#x8BE6;&#x60C5;&#x89C1;&#x4EE5;&#x4E0B;&#x7AE0;&#x8282;&#x3002;</p>
<p>&#x5982;&#x679C; OpenTelemetry &#x4FE1;&#x53F7;&#x7684;&#x67D0;&#x4E2A;&#x7EC4;&#x4EF6;&#x9700;&#x8981;&#x9000;&#x5F79;&#xFF0C;&#x8BE5;&#x7EC4;&#x4EF6;&#x5C06;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;<strong>&#x5E9F;&#x5F03;&#x7684;</strong>&#x3002;&#x88AB;&#x5E9F;&#x5F03;&#x7684;&#x7EC4;&#x4EF6;&#x4E0D;&#x518D;&#x83B7;&#x5F97;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x88AB; OpenTelemetry &#x7684;&#x957F;&#x671F;&#x652F;&#x6301;&#x4FDD;&#x8BC1;&#x6240;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x8BE5;&#x7EC4;&#x4EF6;&#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5E76;&#x5C06;&#x7EE7;&#x7EED;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x5FC5;&#x987B;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5C06;&#x63D0;&#x524D;&#x5BA3;&#x5E03;&#x5220;&#x9664;&#x65E5;&#x671F;&#x3002;</p>
<p>&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x529F;&#x80FD;&#x603B;&#x662F;&#x4E0E;&#x7A33;&#x5B9A;&#x6027;&#x7684;&#x529F;&#x80FD;&#x4FDD;&#x6301;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5305;&#x4E2D;&#xFF0C;&#x7A33;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x5F15;&#x7528;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x786E;&#x4FDD;&#x4E86;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x73B0;&#x6709;&#x7279;&#x6027;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x53EA;&#x8981;&#x5E93;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x7A33;&#x5B9A;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x4E0D;&#x4F1A;&#x7ECF;&#x5386;&#x7834;&#x574F;&#x6027;&#x7684; API &#x53D8;&#x5316;&#x3002;</p>
<figure id="fig1.8.1"><a href="images/f6-1.png" data-lightbox="c5988656-3eaa-4c62-a157-66ced53132c6" data-title="&#x56FE; 6-1&#xFF1A;OpenTelemetry &#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x90FD;&#x88AB;&#x8D4B;&#x4E88;&#x4E86;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x6027;&#x7B49;&#x7EA7;&#xFF0C;&#x5E76;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;"><img src="images/f6-1.png" alt="&#x56FE; 6-1&#xFF1A;OpenTelemetry &#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x90FD;&#x88AB;&#x8D4B;&#x4E88;&#x4E86;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x6027;&#x7B49;&#x7EA7;&#xFF0C;&#x5E76;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;"></a><figcaption>&#x56FE; 6-1&#xFF1A;OpenTelemetry &#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x90FD;&#x88AB;&#x8D4B;&#x4E88;&#x4E86;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x6027;&#x7B49;&#x7EA7;&#xFF0C;&#x5E76;&#x9075;&#x5FAA;&#x76F8;&#x540C;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</figcaption></figure>
<h2 id="api-&#x7684;&#x7A33;&#x5B9A;&#x6027;">API &#x7684;&#x7A33;&#x5B9A;&#x6027;</h2>
<p>OpenTelemetry API &#x9884;&#x8BA1;&#x5C06;&#x88AB;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x5E93;&#x6240;&#x4F9D;&#x8D56;&#xFF0C;&#x6709;&#x6570;&#x4EE5;&#x767E;&#x4E07;&#x8BA1;&#x7684;&#x8C03;&#x7528;&#x7AD9;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;API &#x7684;&#x7A33;&#x5B9A;&#x90E8;&#x5206;&#x51B3;&#x4E0D;&#x80FD;&#x7834;&#x574F;&#x5411;&#x540E;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x8005;&#x548C;&#x5E93;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x5E94;&#x8BE5;&#x4E3A;&#x4E86;&#x5347;&#x7EA7;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7248;&#x672C;&#x7684; API &#x800C;&#x91CD;&#x65B0;&#x6D4B;&#x91CF;&#x4ED6;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A; OpenTelemetry API &#x88AB;&#x5E9F;&#x5F03;&#xFF08;&#x8FD9;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#xFF09;&#xFF0C;&#x88AB;&#x5E9F;&#x5F03;&#x7684; API &#x4ECD;&#x5C06;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x5E76;&#x53D1;&#x6325;&#x529F;&#x80FD;&#x3002;</p>
<blockquote>
<p><strong>&#x539F;&#x751F;&#x5DE5;&#x5177;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x5177;</strong></p>
<p>&#x643A;&#x5E26;&#x539F;&#x751F; OpenTelemetry &#x4EEA;&#x8868;&#x7684; OSS &#x5E93;&#x5E94;&#x8BE5;&#x53EA;&#x4F7F;&#x7528;&#x7A33;&#x5B9A;&#x7684; API&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9A8C;&#x6027;&#x529F;&#x80FD;&#x7684;&#x6539;&#x53D8;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x4F9D;&#x8D56;&#x6027;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9F13;&#x52B1;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5E93;&#x613F;&#x610F;&#x4E3A;&#x5B9E;&#x9A8C;&#x6027;&#x7684; OpenTelemetry &#x529F;&#x80FD;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7ED9;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x53CD;&#x9988;&#x548C;&#x53C2;&#x4E0E;&#x65B0;&#x529F;&#x80FD;&#x8BBE;&#x8BA1;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x5C06;&#x4E0E;&#x5B9E;&#x9A8C;&#x6027; OpenTelemetry &#x529F;&#x80FD;&#x7684;&#x96C6;&#x6210;&#x4F5C;&#x4E3A;&#x53EF;&#x9009;&#x7684;&#x63D2;&#x4EF6;&#x63D0;&#x4F9B;&#xFF0C;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x5355;&#x72EC;&#x5B89;&#x88C5;&#x624D;&#x80FD;&#x542F;&#x7528;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x529F;&#x80FD;&#x53D8;&#x5F97;&#x7A33;&#x5B9A;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x628A;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x63D2;&#x4EF6;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x5C06; OpenTelemetry &#x539F;&#x751F;&#x96C6;&#x6210;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x5B89;&#x88C5;&#x63D2;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x5B89;&#x88C5;&#x4E86; OpenTelemetry SDK&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x5F00;&#x59CB;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x6BCF;&#x4E2A;&#x5E93;&#x7684;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B89;&#x88C5; SDK&#xFF0C;API &#x7684;&#x8C03;&#x7528;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x539F;&#x751F;&#x4EEA;&#x8868;&#x662F;&#x6211;&#x4EEC;&#x5E0C;&#x671B; OpenTelemetry &#x80FD;&#x591F;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x7684;&#x89C2;&#x5BDF;&#x80FD;&#x529B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F; &#x2014;&#x2014; &#x5B83;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x9700;&#x8981;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x4F7F;&#x7528;&#x3002;</p>
</blockquote>
<h2 id="sdk-&#x548C;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7A33;&#x5B9A;&#x6027;">SDK &#x548C;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7A33;&#x5B9A;&#x6027;</h2>
<p>SDK &#x7684;&#x7A33;&#x5B9A;&#x6027;&#x96C6;&#x4E2D;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x63D2;&#x4EF6;&#x63A5;&#x53E3;&#x548C;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x3002;SDK &#x53EF;&#x80FD;&#x5076;&#x5C14;&#x4F1A;&#x5E9F;&#x6B62;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x63A5;&#x53E3;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x8005;&#x80FD;&#x591F;&#x5E72;&#x51C0;&#x5229;&#x843D;&#x5730;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x5E9F;&#x5F03;&#x7684;&#x63A5;&#x53E3;&#x88AB;&#x5220;&#x9664;&#x4E4B;&#x524D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x66FF;&#x4EE3;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x5E9F;&#x5F03;&#x63A5;&#x53E3;&#x7684;&#x6D41;&#x884C;&#x63D2;&#x4EF6;&#x5FC5;&#x987B;&#x88AB;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x7684;&#x63A5;&#x53E3;&#x4E0A;&#x3002;&#x901A;&#x8FC7;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B89;&#x5168;&#x5730;&#x8FC1;&#x79FB;&#x63D2;&#x4EF6;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x9677;&#x5165;&#x8FD9;&#x6837;&#x7684;&#x5883;&#x5730;&#xFF1A;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x5347;&#x7EA7;&#xFF0C;&#x4F46;&#x5374;&#x88AB;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x63D2;&#x4EF6;&#x6240;&#x963B;&#x6321;&#x3002;&#x5728;&#x5E9F;&#x5F03;&#x548C;&#x79FB;&#x9664;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x63A5;&#x53E3;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x6709;&#x81F3;&#x5C11; 6 &#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x5E9F;&#x5F03;&#x7684;&#x63A5;&#x53E3;&#x53EA;&#x6709;&#x5728;&#x7EF4;&#x62A4;&#x5B83;&#x4EEC;&#x4F1A;&#x9020;&#x6210;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x65F6;&#x624D;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x65E0;&#x9650;&#x671F;&#x5730;&#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x88AB;&#x5E9F;&#x5F03;&#x7684;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x6027;&#x80FD;&#xFF0C;OpenTelemetry SDK &#x7684;&#x7A33;&#x5B9A;&#x90E8;&#x5206;&#x5FC5;&#x987B;&#x907F;&#x514D;&#x6027;&#x80FD;&#x5012;&#x9000;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD; SDK &#x7684;&#x8F83;&#x65B0;&#x7248;&#x672C;&#x5728;&#x5347;&#x7EA7;&#x65F6;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;&#x8D44;&#x6E90;&#x4E89;&#x593A;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x542F;&#x7528;&#x65B0;&#x7248;&#x672C;&#x4E2D;&#x589E;&#x52A0;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x5347;&#x7EA7; SDK &#x4E0D;&#x5E94;&#x8BE5;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x9000;&#x6B65;&#x3002;</p>
<p>&#x4E0E; SDK &#x4E00;&#x6837;&#xFF0C;&#x6536;&#x96C6;&#x5668;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x6027;&#x80FD;&#x9000;&#x6B65;&#xFF0C;&#x5E76;&#x4E3A;&#x6536;&#x96C6;&#x5668;&#x63D2;&#x4EF6;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6E10;&#x8FDB;&#x7684;&#x5347;&#x7EA7;&#x8DEF;&#x5F84;&#x3002;</p>
<h2 id="&#x5347;&#x7EA7;-opentelemetry-&#x5BA2;&#x6237;&#x7AEF;">&#x5347;&#x7EA7; OpenTelemetry &#x5BA2;&#x6237;&#x7AEF;</h2>
<p>&#x5728;&#x8FD0;&#x884C; OpenTelemetry &#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x80FD;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x7684; SDK &#x7248;&#x672C;&#x3002;&#x6709;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x8FEB;&#x4F7F;&#x7528;&#x6237;&#x5347;&#x7EA7; SDK&#xFF1A;&#x4E00;&#x4E2A;&#x5E93;&#x5C06;&#x5176;&#x4EEA;&#x8868;&#x5347;&#x7EA7;&#x5230;&#x65B0;&#x7248;&#x672C;&#x7684; API&#xFF0C;&#x6216;&#x8005; OpenTelemetry &#x53D1;&#x5E03;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5B89;&#x5168;&#x8865;&#x4E01;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x4FDD;&#x8BC1;&#x786E;&#x4FDD;&#x4E86;&#x8FD9;&#x79CD;&#x5347;&#x7EA7;&#x8DEF;&#x5F84;&#x59CB;&#x7EC8;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;&#x53EA;&#x8981;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x7A33;&#x5B9A;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x5347;&#x7EA7;&#x5E94;&#x8BE5;&#x53EA;&#x6D89;&#x53CA;&#x4F9D;&#x8D56;&#x6027;&#x7684;&#x63D0;&#x5347;&#x3002;&#x6559;&#x7A0B;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x5199;&#xFF0C;&#x63D2;&#x4EF6;&#x4E5F;&#x4E0D;&#x4F1A;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x4E0D;&#x53D7;&#x652F;&#x6301;&#x3002;</p>
<p>OpenTelemetry &#x81F4;&#x529B;&#x4E8E;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x5B83;&#x5BF9;&#x5176;&#x524D;&#x8EAB; OpenTracing &#x7684;&#x652F;&#x6301;&#x3002;OpenTelemetry &#x8FFD;&#x8E2A;&#x4FE1;&#x53F7;&#x4E0E; OpenTracing API &#x5B8C;&#x5168;&#x517C;&#x5BB9;&#xFF0C;OpenTelemetry &#x548C; OpenTracing API &#x8C03;&#x7528;&#x53EF;&#x4EE5;&#x6DF7;&#x5408;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;OpenTracing &#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5347;&#x7EA7;&#x5230; OpenTelemetry &#x800C;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x5199;&#x73B0;&#x6709;&#x7684;&#x4EEA;&#x8868;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | &#x57FA;&#x4E8E; <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC 4.0 &#x534F;&#x8BAE;</a> &#x53D1;&#x5E03; | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-02-06 02:30:57
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="architectural-overview.html" class="navigation navigation-prev " aria-label="Previous page: 第 5 章：OpenTelemetry 架构概述">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="suggested-setups-and-telemetry-pipelines.html" class="navigation navigation-next " aria-label="Next page: 第 7 章：建议的设置和遥测管道">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第 6 章：稳定和长期支持","level":"1.8","depth":1,"next":{"title":"第 7 章：建议的设置和遥测管道","level":"1.9","depth":1,"path":"suggested-setups-and-telemetry-pipelines.md","ref":"suggested-setups-and-telemetry-pipelines.md","articles":[]},"previous":{"title":"第 5 章：OpenTelemetry 架构概述","level":"1.7","depth":1,"path":"architectural-overview.md","ref":"architectural-overview.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","lightbox","ga","sitemap-general","hide-element"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | 基于 <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC 4.0 协议</a> 发布 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/opentelemetry-obervability"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/opentelemetry-obervability/blob/main/"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/opentelemetry-obervability/"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"【著】Ted Young，【译】Jimmy Song（宋净超）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"history.html#fig1.3.1","level":"1.3","list_caption":"Figure: 图 1-1：可观测性的 \"三大支柱\"。","alt":"图 1-1：可观测性的 \"三大支柱\"。","nro":1,"url":"images/f1-1.png","index":1,"caption_template":"_CAPTION_","label":"图 1-1：可观测性的 \"三大支柱\"。","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"history.html#fig1.3.2","level":"1.3","list_caption":"Figure: 图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","alt":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","nro":2,"url":"images/f1-2.png","index":2,"caption_template":"_CAPTION_","label":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"history.html#fig1.3.3","level":"1.3","list_caption":"Figure: 图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","alt":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","nro":3,"url":"images/f1-3.png","index":3,"caption_template":"_CAPTION_","label":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"history.html#fig1.3.4","level":"1.3","list_caption":"Figure: 图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","alt":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","nro":4,"url":"images/f1-4.png","index":4,"caption_template":"_CAPTION_","label":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"history.html#fig1.3.5","level":"1.3","list_caption":"Figure: 图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","alt":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","nro":5,"url":"images/f1-5.png","index":5,"caption_template":"_CAPTION_","label":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"the-value-of-structured-data.html#fig1.4.1","level":"1.4","list_caption":"Figure: 图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","alt":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","nro":6,"url":"images/f2-1.png","index":1,"caption_template":"_CAPTION_","label":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"the-value-of-structured-data.html#fig1.4.2","level":"1.4","list_caption":"Figure: 图 2-2：一个事务，被视为一组资源。","alt":"图 2-2：一个事务，被视为一组资源。","nro":7,"url":"images/f2-2.png","index":2,"caption_template":"_CAPTION_","label":"图 2-2：一个事务，被视为一组资源。","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"the-value-of-structured-data.html#fig1.4.3","level":"1.4","list_caption":"Figure: 图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","alt":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","nro":8,"url":"images/f2-3.png","index":3,"caption_template":"_CAPTION_","label":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","attributes":{},"skip":false,"key":"1.4.3"},{"backlink":"the-value-of-structured-data.html#fig1.4.4","level":"1.4","list_caption":"Figure: 图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","alt":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","nro":9,"url":"images/f2-4.png","index":4,"caption_template":"_CAPTION_","label":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","attributes":{},"skip":false,"key":"1.4.4"},{"backlink":"architectural-overview.html#fig1.7.1","level":"1.7","list_caption":"Figure: 图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","alt":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","nro":10,"url":"images/f5-1.png","index":1,"caption_template":"_CAPTION_","label":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","attributes":{},"skip":false,"key":"1.7.1"},{"backlink":"architectural-overview.html#fig1.7.2","level":"1.7","list_caption":"Figure: 图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","alt":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","nro":11,"url":"images/f5-2.png","index":2,"caption_template":"_CAPTION_","label":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","attributes":{},"skip":false,"key":"1.7.2"},{"backlink":"architectural-overview.html#fig1.7.3","level":"1.7","list_caption":"Figure: 图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","alt":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","nro":12,"url":"images/f5-3.png","index":3,"caption_template":"_CAPTION_","label":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","attributes":{},"skip":false,"key":"1.7.3"},{"backlink":"stability-and-long-term-support.html#fig1.8.1","level":"1.8","list_caption":"Figure: 图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","alt":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","nro":13,"url":"images/f6-1.png","index":1,"caption_template":"_CAPTION_","label":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","attributes":{},"skip":false,"key":"1.8.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.1","level":"1.9","list_caption":"Figure: 图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","alt":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","nro":14,"url":"images/f7-1.png","index":1,"caption_template":"_CAPTION_","label":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","attributes":{},"skip":false,"key":"1.9.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.2","level":"1.9","list_caption":"Figure: 图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","alt":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","nro":15,"url":"images/f7-2.png","index":2,"caption_template":"_CAPTION_","label":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","attributes":{},"skip":false,"key":"1.9.2"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.3","level":"1.9","list_caption":"Figure: 图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","alt":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","nro":16,"url":"images/f7-3.png","index":3,"caption_template":"_CAPTION_","label":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","attributes":{},"skip":false,"key":"1.9.3"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.4","level":"1.9","list_caption":"Figure: 图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","alt":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","nro":17,"url":"images/f7-4.png","index":4,"caption_template":"_CAPTION_","label":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","attributes":{},"skip":false,"key":"1.9.4"}]},"title":"OpenTelemetry 可观测性的未来","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生社区":"https://cloudnative.to/"}},"gitbook":"*","description":"OpenTelemetry 可观察性的未来 | O'Reilly 报告"},"file":{"path":"stability-and-long-term-support.md","mtime":"2022-02-06T02:30:57.848Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-02-06T02:31:23.728Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

