
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第 4 章：支持开源和原生监测 · OpenTelemetry 可观测性的未来</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="【著】Ted Young，【译】Jimmy Song（宋净超）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="architectural-overview.html" />
    
    
    <link rel="prev" href="the-limitations-of-automated-analysis.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to/" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="history.html">
            
                <a href="history.html">
            
                    
                    第 1 章：可观测性的历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="the-value-of-structured-data.html">
            
                <a href="the-value-of-structured-data.html">
            
                    
                    第 2 章：结构化数据的价值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="the-limitations-of-automated-analysis.html">
            
                <a href="the-limitations-of-automated-analysis.html">
            
                    
                    第 3 章：自动分析的局限性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="supporting-open-source-and-native-instrumentation.html">
            
                <a href="supporting-open-source-and-native-instrumentation.html">
            
                    
                    第 4 章：支持开源和原生监测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="architectural-overview.html">
            
                <a href="architectural-overview.html">
            
                    
                    第 5 章：OpenTelemetry 架构概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="stability-and-long-term-support.html">
            
                <a href="stability-and-long-term-support.html">
            
                    
                    第 6 章：稳定和长期支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="suggested-setups-and-telemetry-pipelines.html">
            
                <a href="suggested-setups-and-telemetry-pipelines.html">
            
                    
                    第 7 章：建议的设置和遥测管道
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="roll-out.html">
            
                <a href="roll-out.html">
            
                    
                    第 8 章：如何在组织中推广 OpenTelemetry
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="organization.html">
            
                <a href="organization.html">
            
                    
                    附录 A：OpenTelemetry 项目组织
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="roadmap.html">
            
                <a href="roadmap.html">
            
                    
                    附录 B：OpenTelemetry 项目路线图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第 4 章：支持开源和原生监测</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-4-&#x7AE0;&#xFF1A;&#x652F;&#x6301;&#x5F00;&#x6E90;&#x548C;&#x539F;&#x751F;&#x76D1;&#x6D4B;">&#x7B2C; 4 &#x7AE0;&#xFF1A;&#x652F;&#x6301;&#x5F00;&#x6E90;&#x548C;&#x539F;&#x751F;&#x76D1;&#x6D4B;</h1>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4ECE;&#x6570;&#x636E;&#x7684;&#x89D2;&#x5EA6;&#x8BA8;&#x8BBA;&#x4E86;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x88AB;&#x8BC1;&#x660E;&#x540C;&#x6837;&#x91CD;&#x8981;&#xFF1A;&#x5982;&#x4F55;&#x5BF9;&#x5F85;&#x4EA7;&#x751F;&#x6570;&#x636E;&#x7684;&#x4EEA;&#x8868;&#xFF08;instrumention&#xFF09;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x7528;&#x73B0;&#x6210;&#x7684;&#x90E8;&#x4EF6;&#x6784;&#x5EFA;&#x7684;&#xFF1A;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;HTTP &#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x7EC4;&#x7EC7;&#x4E2D;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x8FD9;&#x79CD;&#x8F6F;&#x4EF6;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x662F;&#x5728;&#x5185;&#x90E8;&#x7F16;&#x5199;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x662F;&#x5728;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#x4E2D;&#x5171;&#x4EAB;&#x7684;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5171;&#x4EAB;&#x7EC4;&#x4EF6;&#x662F;&#x4EE5;&#x5F00;&#x653E;&#x6E90;&#x7801;&#xFF08;OSS&#xFF09;&#x5E93;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x8BB8;&#x53EF;&#x6743;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x5E93;&#x51E0;&#x4E4E;&#x56CA;&#x62EC;&#x4E86;&#x4E00;&#x822C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5173;&#x952E;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x83B7;&#x5F97;&#x8FD9;&#x4E9B;&#x5E93;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x8BF4;&#x660E;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x4EEA;&#x8868;&#x662F; &quot;&#x5355;&#x72EC;&#x51FA;&#x552E;&quot; &#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x8F6F;&#x4EF6;&#x5E93;&#x4E0D;&#x5305;&#x62EC;&#x4EA7;&#x751F;&#x8FFD;&#x8E2A;&#x3001;&#x65E5;&#x5FD7;&#x6216;&#x5EA6;&#x91CF;&#x7684;&#x4EEA;&#x8868;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x662F;&#x5728;&#x4E8B;&#x540E;&#x6DFB;&#x52A0;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;&#x90E8;&#x7F72;&#x53EF;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<blockquote>
<p><strong>&#x4EC0;&#x4E48;&#x662F;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EEA;&#x8868;&#xFF1F;</strong></p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x672F;&#x8BED; &quot;<strong>&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EEA;&#x8868;</strong>&quot; &#x662F;&#x6307;&#x4EFB;&#x4F55;&#x65E8;&#x5728;&#x4E0E;&#x7279;&#x5B9A;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x7684;&#x4EEA;&#x8868;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4F5C;&#x4E3A;&#x8BE5;&#x7279;&#x5B9A;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x4EA7;&#x7269;&#x800C;&#x5F00;&#x53D1;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x5E38;&#x5E38;&#x6DF1;&#x6DF1;&#x5730;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x8981;&#x4ECE;&#x4E00;&#x4E2A;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x7684;&#x91CD;&#x65B0;&#x5E03;&#x8BBE;&#x3002;</p>
</blockquote>
<p>&#x9488;&#x5BF9;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x662F; &quot;&#x4E09;&#x5927;&#x652F;&#x67F1;&quot; &#x4E2D;&#x56FA;&#x6709;&#x7684;&#x5782;&#x76F4;&#x6574;&#x5408;&#x7684;&#x9057;&#x7559;&#x95EE;&#x9898;&#x3002;&#x6BCF;&#x4E2A;&#x540E;&#x7AEF;&#x90FD;&#x6444;&#x53D6;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x4E13;&#x6709;&#x6570;&#x636E;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x540E;&#x7AEF;&#x7684;&#x521B;&#x5EFA;&#x8005;&#x4E5F;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4EA7;&#x751F;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x4EEA;&#x8868;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5DE5;&#x5177;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x7ED9;&#x53C2;&#x4E0E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5E26;&#x6765;&#x4E86;&#x9EBB;&#x70E6;&#xFF1A;&#x4F9B;&#x5E94;&#x5546;&#x3001;&#x7528;&#x6237;&#x548C;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x3002;</p>
<h2 id="&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x88AB;&#x6DF9;&#x6CA1;&#x5728;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x4E2D;">&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x88AB;&#x6DF9;&#x6CA1;&#x5728;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x4E2D;</h2>
<p>&#x4ECE;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4EEA;&#x8868;&#x5316;&#x4EE3;&#x8868;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x5728;&#x8FC7;&#x53BB;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x662F;&#x76F8;&#x5F53;&#x540C;&#x8D28;&#x5316;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x6765;&#x5EFA;&#x7ACB;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x3002;Java Spring&#x3001;Ruby on Rails &#x6216; .NET&#x3002;&#x4F46;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x8F6F;&#x4EF6;&#x7684;&#x591A;&#x6837;&#x6027;&#x5DF2;&#x7ECF;&#x7206;&#x70B8;&#x6027;&#x589E;&#x957F;&#x3002;&#x73B0;&#x5728;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x548C;&#x6570;&#x636E;&#x5E93;&#x5BA2;&#x6237;&#x7AEF;&#x7EF4;&#x62A4;&#x4EEA;&#x8868;&#x662F;&#x4E00;&#x9879;&#x5DE8;&#x5927;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#x8FD9;&#x5BFC;&#x81F4;&#x7684;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#x96BE;&#x4EE5;&#x4F30;&#x91CF;&#x3002;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x4F9B;&#x5E94;&#x5546;&#x5C06;&#x4ED6;&#x4EEC;&#x5728;&#x4EEA;&#x8868;&#x4E0A;&#x7684;&#x6295;&#x8D44;&#x4F5C;&#x4E3A;&#x9500;&#x552E;&#x70B9;&#x548C;&#x628A;&#x5173;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x65E5;&#x76CA;&#x589E;&#x957F;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4F7F;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x65E0;&#x6CD5;&#x7EF4;&#x6301;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x89C4;&#x6A21;&#x7684;&#x4EEA;&#x8868;&#x8BBE;&#x5907;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x8986;&#x76D6;&#x9762;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x65E0;&#x6CD5;&#x8DDF;&#x4E0A;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x8D1F;&#x62C5;&#x5BF9;&#x4E8E;&#x65B0;&#x7684;&#x3001;&#x65B0;&#x9896;&#x7684;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x7684;&#x89C2;&#x6D4B;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#x5C24;&#x5176;&#x4E25;&#x5CFB;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x7F16;&#x5199;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4EEA;&#x8868;&#x4E4B;&#x524D;&#x65E0;&#x6CD5;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x90E8;&#x7F72;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x5728;&#x5E7F;&#x6CDB;&#x90E8;&#x7F72;&#x4E4B;&#x524D;&#x4E5F;&#x65E0;&#x6CD5;&#x5438;&#x5F15;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x90A3;&#x4E48;&#x79D1;&#x5B66;&#x8FDB;&#x6B65;&#x5C31;&#x4F1A;&#x9677;&#x5165;&#x50F5;&#x5C40;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x8FFD;&#x8E2A;&#x7684;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x5C24;&#x5176;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4EEA;&#x8868;&#x6765;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x9501;&#x5B9A;&#x5728;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x4E2D;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x9501;&#x5B9A;&#x5728;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x4E2D;</h2>
<p>&#x4ECE;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x6709;&#x5BB3;&#x7684;&#x9501;&#x5B9A;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8981;&#x5F7B;&#x5E95;&#x8FFD;&#x8E2A;&#x3001;&#x8BB0;&#x5F55;&#x6216;&#x5EA6;&#x91CF;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x4EEA;&#x8868; API &#x8C03;&#x7528;&#x5C06;&#x904D;&#x5E03;&#x6574;&#x4E2A;&#x4EE3;&#x7801;&#x5E93;&#x3002;&#x6539;&#x53D8;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x628A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x53BB;&#x6389;&#xFF0C;&#x7528;&#x65B0;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x4E0D;&#x540C;&#x5DE5;&#x5177;&#x6765;&#x4EE3;&#x66FF;&#x3002;</p>
<p>&#x66FF;&#x6362;&#x4EEA;&#x8868;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x5927;&#x7684;&#x524D;&#x671F;&#x6295;&#x8D44;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5C1D;&#x8BD5;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x66F4;&#x7CDF;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x90FD;&#x592A;&#x5927;&#x4E86;&#x4EE5;&#x81F4;&#x4E8E;&#x5728;&#x6240;&#x6709;&#x670D;&#x52A1;&#x4E2D;&#x540C;&#x65F6;&#x66F4;&#x6362;&#x6240;&#x6709;&#x4EEA;&#x8868;&#x662F;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x3002;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x9010;&#x6B65;&#x63A8;&#x51FA;&#x65B0;&#x7684;&#x4EEA;&#x8868;&#x8BBE;&#x5907;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x4E0A;&#x7EBF;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x88AB;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x6240; &quot;&#x56F0;&#x4F4F;&quot; &#x662F;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x7684;&#x3002;&#x5728;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x4F9B;&#x5E94;&#x5546;&#x5F00;&#x59CB;&#x52AA;&#x529B;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x4EEA;&#x8868;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x4E5F;&#x5F00;&#x59CB;&#x62D2;&#x7EDD;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x4EEA;&#x8868;&#x3002;&#x7531;&#x4E8E;&#x4E86;&#x89E3;&#x5230;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x4EEA;&#x8868;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x5F3A;&#x70C8;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x8003;&#x8651;&#x7684;&#x4EFB;&#x4F55;&#x65B0;&#x7684;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x80FD;&#x4E0E;&#x4ED6;&#x4EEC;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4EEA;&#x8868;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x8FD9;&#x4E00;&#x8981;&#x6C42;&#xFF0C;&#x8BB8;&#x591A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x8BD5;&#x56FE;&#x4E0E;&#x5176;&#x4ED6;&#x51E0;&#x4E2A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x4EEA;&#x8868;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x62FC;&#x51D1;&#x7684;&#x65B9;&#x5F0F;&#x964D;&#x4F4E;&#x4E86;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x6240;&#x6444;&#x53D6;&#x7684;&#x6570;&#x636E;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x4ECE;&#x8BB8;&#x591A;&#x6765;&#x6E90;&#x6444;&#x53D6;&#x6570;&#x636E;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x518D;&#x6709;&#x660E;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5F53;&#x9884;&#x671F;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x5747;&#x8861;&#x4E14;&#x5B9A;&#x4E49;&#x6A21;&#x7CCA;&#x65F6;&#xFF0C;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x5C31;&#x5F88;&#x96BE;&#x5B8C;&#x6210;&#x5B83;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x9488;&#x5BF9;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;">&#x9488;&#x5BF9;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;</h2>
<p>&#x4ECE;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x5E93;&#x4F5C;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x60B2;&#x5267;&#x3002;</p>
<p>&#x6765;&#x81EA;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x5E93;&#x7684;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x5BF9;&#x4E8E;&#x64CD;&#x4F5C;&#x5EFA;&#x7ACB;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x6700;&#x4E86;&#x89E3;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x5BF9;&#x64CD;&#x4F5C;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4EBA;&#xFF0C;&#x4EE5;&#x53CA;&#x64CD;&#x4F5C;&#x8005;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6765;&#x8865;&#x6551;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x662F;&#x5B9E;&#x9645;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x6E90;&#x5E93;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x5374;&#x9677;&#x5165;&#x4E86;&#x56F0;&#x5883;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#x5316; API&#xFF0C;&#x65E0;&#x8BBA;&#x5199;&#x5F97;&#x591A;&#x4E48;&#x597D;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x4F5C;&#x4E3A;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x5E93;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5E93;&#xFF1F;">&#x5982;&#x4F55;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5E93;&#xFF1F;</h2>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x4F1F;&#x5927;&#x7684;&#x5F00;&#x6E90;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x90FD;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x4F60;&#x81EA;&#x7136;&#x5E0C;&#x671B;&#x628A;&#x9519;&#x8BEF;&#x3001;&#x8C03;&#x8BD5;&#x548C;&#x6027;&#x80FD;&#x4FE1;&#x606F;&#x4F20;&#x8FBE;&#x7ED9;&#x4F60;&#x7684;&#x7528;&#x6237;&#x3002;&#x4F60;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x65E5;&#x5FD7;&#x5E93;&#xFF1F;</p>
<p>&#x6709;&#x5F88;&#x591A;&#x4F53;&#x9762;&#x7684;&#x65E5;&#x5FD7;&#x5E93;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x9009;&#x62E9;&#x54EA;&#x4E2A;&#x5E93;&#xFF0C;&#x4F60;&#x90FD;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x4F60;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E93;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684; Web &#x6846;&#x67B6;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5E93;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x5E93;&#x5BA2;&#x6237;&#x7AEF;&#x5E93;&#x9009;&#x62E9;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x4E2A;&#x90FD;&#x4E0D;&#x662F;&#x7528;&#x6237;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x5E93;&#x7684;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x7248;&#x672C;&#x5462;&#xFF1F;</p>
<p>&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5C06;&#x591A;&#x4E2A;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x65E5;&#x5FD7;&#x5E93;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x8FDE;&#x8D2F;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x867D;&#x7136;&#x65E5;&#x5FD7;&#x8DB3;&#x591F;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x540C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5927;&#x6742;&#x70E9;&#x53EF;&#x80FD;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x6307;&#x6807;&#x548C;&#x8FFD;&#x8E2A;&#x6765;&#x8BF4;&#xFF0C;&#x60C5;&#x51B5;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x5E93;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x65E5;&#x5FD7;&#x3001;&#x5EA6;&#x91CF;&#x6216;&#x8FFD;&#x8E2A;&#x529F;&#x80FD;&#x3002;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#xFF0C;&#x5E93;&#x63D0;&#x4F9B;&#x4E86; &quot;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x94A9;&#x5B50;&quot;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x7528;&#x6237;&#x7F16;&#x5199;&#x548C;&#x7EF4;&#x62A4;&#x4E00;&#x5806;&#x9002;&#x914D;&#x5668;&#xFF0C;&#x5C06;&#x4F7F;&#x7528;&#x7684;&#x5E93;&#x8FDE;&#x63A5;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x4EEC;&#x6709;&#x5927;&#x91CF;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4ED6;&#x4EEC;&#x60F3;&#x901A;&#x4FE1;&#x5173;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x505A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x4EFB;&#x4F55;&#x5199;&#x8FC7;&#x5927;&#x91CF;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x75DB;&#x82E6;&#x7684;&#xFF01;&#x800C;&#x4E14;&#x662F;&#x4E0D;&#x5E78;&#x7684;&#xFF01;&#x4E00;&#x4E9B;&#x5E93;&#x7684;&#x4F5C;&#x8005;<strong>&#x786E;&#x5B9E;</strong>&#x8BD5;&#x56FE;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5E93;&#xFF0C;&#x4F46;&#x5374;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x65E0;&#x610F;&#x4E2D;&#x4E3A;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x9020;&#x6210;&#x4E86;&#x7248;&#x672C;&#x51B2;&#x7A81;&#xFF0C;&#x540C;&#x65F6;&#x8FEB;&#x4F7F;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7F16;&#x5199;&#x65E5;&#x5FD7;&#x9002;&#x914D;&#x5668;&#x6765;&#x6355;&#x6349;&#x4F7F;&#x7528;&#x5176;<strong>&#x5B9E;&#x9645;</strong>&#x65E5;&#x5FD7;&#x5E93;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5E93;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x540E;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x7ECF;&#x5E38;&#x7F16;&#x5199;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#x5957;&#x4EF6;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x5F88;&#x5C11;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x8003;&#x8651;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x3002;&#x8003;&#x8651;&#x5230;&#x5E93;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5DE5;&#x5177;&#x4E3A;&#x96F6;&#xFF0C;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7AE0;&#x4E2D;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x4E3A;&#x4E86;&#x4F7F;&#x5728;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7BA1;&#x9053;&#x4E2D;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x4EE3;&#x7406;&#x6743;&#x6700;&#x5927;&#x5316;&#x3002;&#x4F46;&#x53D7;&#x76CA;&#x6700;&#x5927;&#x7684;&#x662F;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#xFF1B;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EEA;&#x8868;&#xFF0C;&#x4ED6;&#x4EEC;&#x76EE;&#x524D;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="&#x5206;&#x89E3;&#x95EE;&#x9898;">&#x5206;&#x89E3;&#x95EE;&#x9898;</h2>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x6765;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x660E;&#x786E;&#x5730;&#x89E3;&#x51B3;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x73B0;&#x4EE3;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5206;&#x89E3;&#x4E3A;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x3002;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x5C06;&#x4E3A;&#x7B2C;&#x4E94;&#x7AE0;&#x4E2D;&#x63CF;&#x8FF0;&#x7684; OpenTelemetry &#x7684;&#x7ED3;&#x6784;&#x63D0;&#x4F9B;&#x52A8;&#x529B;&#x3002;</p>
<h2 id="&#x8981;&#x6C42;&#xFF1A;&#x72EC;&#x7ACB;&#x7684;&#x4EEA;&#x8868;&#x3001;&#x9065;&#x6D4B;&#x548C;&#x5206;&#x6790;">&#x8981;&#x6C42;&#xFF1A;&#x72EC;&#x7ACB;&#x7684;&#x4EEA;&#x8868;&#x3001;&#x9065;&#x6D4B;&#x548C;&#x5206;&#x6790;</h2>
<p>&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x7CFB;&#x7EDF;&#x3002;&#x50CF;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x8FD9;&#x6837;&#x7684;&#x8DE8;&#x9886;&#x57DF;&#x95EE;&#x9898;&#xFF0C;&#x51E0;&#x4E4E;&#x4E0E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7EC4;&#x4EF6;&#x90FD;&#x6709;&#x4E92;&#x52A8;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4F20;&#x8F93;&#x548C;&#x5904;&#x7406;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x6279;&#x91CF;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4E00;&#x4E2A;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x4F1A;&#x4EA7;&#x751F;&#x81EA;&#x5DF1;&#x7684;&#x64CD;&#x4F5C;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x9700;&#x8981;&#x4E0E;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x9762;&#x4EA4;&#x4E92;&#x3002;&#x4E3A;&#x4E86;&#x5F88;&#x597D;&#x5730;&#x670D;&#x52A1;&#x4E8E;&#x4ED6;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#x7684;&#x4EBA;&#x90FD;&#x6709;&#x4ED6;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x7684;&#x4EE3;&#x7406;&#x6743;&#xFF0C;&#x4EE5;&#x4FBF;&#x5FEB;&#x901F;&#x548C;&#x72EC;&#x7ACB;&#x5730;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x63D0;&#x4F9B;&#x4EE3;&#x7406;&#x6743;&#x662F;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x89C2;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x786E;&#x5B9A;&#x4E0E;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6709;&#x5173;&#x7684;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x8D23;&#x4EFB;&#xFF1A;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x8005;&#x3001;&#x64CD;&#x4F5C;&#x8005;&#x548C;&#x54CD;&#x5E94;&#x8005;&#x3002;</p>
<p><strong>&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x8F6F;&#x4EF6;&#x7684;&#x60C5;&#x51B5;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x5C01;&#x88C5;&#x4E86;&#x5173;&#x952E;&#x529F;&#x80FD;&#x7684;&#x8F6F;&#x4EF6;&#x5E93;&#xFF0C;&#x5982;&#x7F51;&#x7EDC;&#x548C;&#x8BF7;&#x6C42;&#x7BA1;&#x7406;&#xFF0C;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x4E5F;&#x5FC5;&#x987B;&#x7BA1;&#x7406;&#x8FFD;&#x8E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x6CE8;&#x5165;&#x3001;&#x63D0;&#x53D6;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x4F20;&#x64AD;&#x3002;</p>
<p><strong>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x62E5;&#x6709;&#x8005;&#x7EC4;&#x7EC7;&#x8F6F;&#x4EF6;&#x5E76;&#x7BA1;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</strong></p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x9009;&#x62E9;&#x6784;&#x6210;&#x5176;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x7F16;&#x8BD1;&#x6210;&#x4E00;&#x4E2A;&#x8FDE;&#x8D2F;&#x7684;&#x3001;&#x6709;&#x529F;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x8FD8;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x522B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x4E0E;&#x5E93;&#x4F5C;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x6307;&#x4EE4;&#xFF08;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x4F20;&#x64AD;&#xFF09;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p><strong>&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x7BA1;&#x7406;&#x9065;&#x6D4B;&#x7684;&#x751F;&#x4EA7;&#x548C;&#x4F20;&#x8F93;</strong></p>
<p>&#x8FD0;&#x7EF4;&#x7BA1;&#x7406;&#x4ECE;&#x5E94;&#x7528;&#x5230;&#x54CD;&#x5E94;&#x8005;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x6570;&#x636E;&#x7684;&#x4F20;&#x8F93;&#x3002;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x9009;&#x62E9;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x7684;&#x53D1;&#x9001;&#x5730;&#x70B9;&#x3002;&#x5F53;&#x6570;&#x636E;&#x5728;&#x4EA7;&#x751F;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x64CD;&#x4F5C;&#x4F20;&#x8F93;&#x7CFB;&#x7EDF;&#xFF1A;&#x7BA1;&#x7406;&#x7F13;&#x51B2;&#x3001;&#x5904;&#x7406;&#x548C;&#x4F20;&#x9001;&#x6570;&#x636E;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x3002;</p>
<p><strong>&#x54CD;&#x5E94;&#x8005;&#x6D88;&#x8D39;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x5E76;&#x4EA7;&#x751F;&#x6709;&#x7528;&#x7684;&#x89C1;&#x89E3;</strong></p>
<p>&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5E94;&#x5BF9;&#x8005;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53CA;&#x5176;&#x5185;&#x5728;&#x610F;&#x4E49;&#xFF08;&#x7ED3;&#x6784;&#x548C;&#x610F;&#x4E49;&#x5C06;&#x5728;&#x7B2C;&#x4E09;&#x7AE0;&#x4E2D;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF09;&#x3002;&#x5F53;&#x65B0;&#x7684;&#x548C;&#x6539;&#x8FDB;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x53CD;&#x5E94;&#x8005;&#x8FD8;&#x9700;&#x8981;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x7BB1;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x4EE3;&#x8868;&#x4E0D;&#x540C;&#x7684;&#x51B3;&#x7B56;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x53D1;&#x5E03;&#x5176;&#x4EE3;&#x7801;&#x7684;&#x65B0;&#x7248;&#x672C;&#x6765;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x90E8;&#x7F72;&#x5176;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x65B0;&#x7248;&#x672C;&#x6765;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;</li>
<li>&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x548C;&#x914D;&#x7F6E;&#x6765;&#x8FDB;&#x884C;&#x6539;&#x53D8;&#x3002;</li>
<li>&#x54CD;&#x5E94;&#x8005;&#x53EA;&#x80FD;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x505A;&#x51FA;&#x6539;&#x53D8;&#x3002;</li>
</ul>
<p>&#x4F20;&#x7EDF;&#x7684;&#x4E09;&#x5927;&#x652F;&#x67F1;&#x65B9;&#x6CD5;&#x6270;&#x4E71;&#x4E86;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x89D2;&#x8272;&#x3002;&#x5782;&#x76F4;&#x6574;&#x5408;&#x7684;&#x4E00;&#x4E2A;&#x526F;&#x4F5C;&#x7528;&#x662F;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x3002;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x5BF9;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x7684;&#x975E;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x6539;&#x53D8;&#x90FD;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x3002;&#x8981;&#x6C42;&#x5176;&#x4ED6;&#x4EBA;&#x8FDB;&#x884C;&#x4F60;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x963B;&#x529B;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x538B;&#x529B;&#x3001;&#x51B2;&#x7A81;&#x548C;&#x4E0D;&#x4F5C;&#x4E3A;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x4FA7;&#x91CD;&#x4E8E;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x4EBA;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4EE3;&#x7406;&#x548C;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x5C06;&#x5F00;&#x53D1;&#x8005;&#x53D8;&#x6210;&#x610F;&#x5916;&#x7684;&#x770B;&#x95E8;&#x4EBA;&#x3002;</p>
<h2 id="&#x8981;&#x6C42;&#xFF1A;&#x96F6;&#x4F9D;&#x8D56;&#x6027;">&#x8981;&#x6C42;&#xFF1A;&#x96F6;&#x4F9D;&#x8D56;&#x6027;</h2>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x7531;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF08;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x3001;&#x6570;&#x636E;&#x5E93;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#xFF0C;&#x52A0;&#x4E0A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF08;OpenTelemetry &#x6216;&#x5176;&#x4ED6;&#x4EEA;&#x8868;&#x5E93;&#xFF09;&#xFF0C;&#x52A0;&#x4E0A;&#x5B83;&#x4EEC;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF08;&#x65E0;&#x8BBA;&#x8FD9;&#x4E9B;&#x4EEA;&#x8868;&#x5E93;&#x4F9D;&#x8D56;&#x4EC0;&#x4E48;&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x88AB;&#x79F0;&#x4E3A;&#x53CD;&#x5F0F;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x4E24;&#x4E2A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4E4B;&#x95F4;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E24;&#x4E2A;&#x5E93;&#x53EF;&#x80FD;&#x5206;&#x522B;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#xFF08;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#xFF09;&#x5E95;&#x5C42;&#x7F51;&#x7EDC;&#x5E93;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5982; gRPC&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x4E0D;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5E93;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x7684;&#x5B89;&#x5168;&#x8865;&#x4E01;&#xFF0C;&#x4F46;&#x4E5F;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x5347;&#x7EA7;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x8FC7;&#x6E21;&#x6027;&#x4F9D;&#x8D56;&#x51B2;&#x7A81;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x9EBB;&#x70E6;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x51B2;&#x7A81;&#x65E0;&#x6CD5;&#x72EC;&#x7ACB;&#x89E3;&#x51B3;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6709;&#x8005;&#x5FC5;&#x987B;&#x8054;&#x7CFB;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#xFF0C;&#x8981;&#x6C42;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x6700;&#x7EC8;&#x9700;&#x8981;&#x65F6;&#x95F4;&#xFF08;&#x5047;&#x8BBE;&#x5E93;&#x7684;&#x4F5C;&#x8005;&#x56DE;&#x5E94;&#x4E86;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x5E93;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5D4C;&#x5165;&#x4EEA;&#x8868;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5F53;&#x4ED6;&#x4EEC;&#x7684;&#x5E93;&#x88AB;&#x7528;&#x4E8E;&#x7EC4;&#x6210;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#x800C;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E0D;&#x5305;&#x542B;&#x53EF;&#x80FD;&#x65E0;&#x610F;&#x4E2D;&#x5F15;&#x53D1;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#x51B2;&#x7A81;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x7684;&#x4EEA;&#x8868;&#x3002;</p>
<h2 id="&#x8981;&#x6C42;&#xFF1A;&#x4E25;&#x683C;&#x7684;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x548C;&#x957F;&#x671F;&#x652F;&#x6301;">&#x8981;&#x6C42;&#xFF1A;&#x4E25;&#x683C;&#x7684;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x548C;&#x957F;&#x671F;&#x652F;&#x6301;</h2>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x4EEA;&#x8868;&#x5316;&#x7684; API &#x7834;&#x574F;&#x4E86;&#x5411;&#x540E;&#x7684;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x574F;&#x4E8B;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x4E00;&#x4E2A;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x4EEA;&#x8868;&#x8C03;&#x7528;&#x7AD9;&#x70B9;&#x3002;&#x7531;&#x4E8E; API &#x7684;&#x6539;&#x53D8;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x66F4;&#x65B0;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x8C03;&#x7528;&#x7AD9;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x79CD;&#x7279;&#x522B;&#x7CDF;&#x7CD5;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x51B2;&#x7A81;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x7684;&#x4EEA;&#x8868;&#x5316;&#x4E0D;&#x518D;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x5E93;&#x4E2D;&#x7684;&#x4EEA;&#x8868;&#x5316;&#x517C;&#x5BB9;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4EEA;&#x8868;&#x5316; API &#x5FC5;&#x987B;&#x5728;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x5177;&#x6709;&#x4E25;&#x683C;&#x7684;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x80FD;&#x529B;&#x3002;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x4EEA;&#x8868;&#x5316; API &#x4E00;&#x65E6;&#x53D8;&#x5F97;&#x7A33;&#x5B9A;&#xFF0C;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x3002;&#x65B0;&#x7684;&#x3001;&#x5B9E;&#x9A8C;&#x6027;&#x7684; API &#x529F;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#x4E0D;&#x4F1A;&#x5728;&#x5305;&#x542B;&#x7A33;&#x5B9A;&#x4EEA;&#x8868;&#x7684;&#x5E93;&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x3002;</p>
<h2 id="&#x5206;&#x79BB;&#x5173;&#x6CE8;&#x70B9;&#x662F;&#x826F;&#x597D;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;">&#x5206;&#x79BB;&#x5173;&#x6CE8;&#x70B9;&#x662F;&#x826F;&#x597D;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;</h2>
<p>&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6DF1;&#x5165;&#x7814;&#x7A76; OpenTelemetry &#x7684;&#x67B6;&#x6784;&#xFF0C;&#x770B;&#x770B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x6EE1;&#x8DB3;&#x4E0A;&#x9762;&#x63D0;&#x51FA;&#x7684;&#x8981;&#x6C42;&#x7684;&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E9B;&#x5947;&#x7279;&#x7684;&#x73B0;&#x8C61;&#xFF1A;&#x5B83;&#x4EEC;&#x4E2D;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x4FDD;&#x6301;&#x5411;&#x540E;&#x7684;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x65E0;&#x8C13;&#x5E72;&#x6270;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x8981;&#x6C42;&#x90FD;&#x6307;&#x51FA;&#x4E86;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x79BB;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x5E76;&#x4E0D;&#x662F; OpenTelemetry &#x6240;&#x72EC;&#x6709;&#x7684;&#x3002;&#x4EFB;&#x4F55;&#x5BFB;&#x6C42;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x5E93;&#x90FD;&#x4F1A;&#x5F88;&#x597D;&#x5730;&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;OpenTelemetry &#x7684;&#x8BBE;&#x8BA1;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8BBE;&#x8BA1;&#x4E00;&#x822C;&#x7684;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x6307;&#x5357;&#x3002;&#x4E0B;&#x6B21;&#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x8BF7;&#x9884;&#x5148;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#xFF0C;&#x76F8;&#x5E94;&#x5730;&#x8BBE;&#x8BA1;&#x4F60;&#x7684;&#x5E93;&#x53CA;&#x4F60;&#x7684;&#x7528;&#x6237;&#x4F1A;&#x611F;&#x8C22;&#x4F60;&#x7684;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | &#x57FA;&#x4E8E; <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC 4.0 &#x534F;&#x8BAE;</a> &#x53D1;&#x5E03; | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-02-06 03:51:06
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="the-limitations-of-automated-analysis.html" class="navigation navigation-prev " aria-label="Previous page: 第 3 章：自动分析的局限性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="architectural-overview.html" class="navigation navigation-next " aria-label="Next page: 第 5 章：OpenTelemetry 架构概述">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第 4 章：支持开源和原生监测","level":"1.6","depth":1,"next":{"title":"第 5 章：OpenTelemetry 架构概述","level":"1.7","depth":1,"path":"architectural-overview.md","ref":"architectural-overview.md","articles":[]},"previous":{"title":"第 3 章：自动分析的局限性","level":"1.5","depth":1,"path":"the-limitations-of-automated-analysis.md","ref":"the-limitations-of-automated-analysis.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","lightbox","ga","sitemap-general","hide-element"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | 基于 <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC 4.0 协议</a> 发布 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/opentelemetry-obervability"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/opentelemetry-obervability/blob/main/"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/opentelemetry-obervability/"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"【著】Ted Young，【译】Jimmy Song（宋净超）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"history.html#fig1.3.1","level":"1.3","list_caption":"Figure: 图 1-1：可观测性的 \"三大支柱\"。","alt":"图 1-1：可观测性的 \"三大支柱\"。","nro":1,"url":"images/f1-1.png","index":1,"caption_template":"_CAPTION_","label":"图 1-1：可观测性的 \"三大支柱\"。","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"history.html#fig1.3.2","level":"1.3","list_caption":"Figure: 图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","alt":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","nro":2,"url":"images/f1-2.png","index":2,"caption_template":"_CAPTION_","label":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"history.html#fig1.3.3","level":"1.3","list_caption":"Figure: 图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","alt":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","nro":3,"url":"images/f1-3.png","index":3,"caption_template":"_CAPTION_","label":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"history.html#fig1.3.4","level":"1.3","list_caption":"Figure: 图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","alt":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","nro":4,"url":"images/f1-4.png","index":4,"caption_template":"_CAPTION_","label":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"history.html#fig1.3.5","level":"1.3","list_caption":"Figure: 图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","alt":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","nro":5,"url":"images/f1-5.png","index":5,"caption_template":"_CAPTION_","label":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"the-value-of-structured-data.html#fig1.4.1","level":"1.4","list_caption":"Figure: 图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","alt":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","nro":6,"url":"images/f2-1.png","index":1,"caption_template":"_CAPTION_","label":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"the-value-of-structured-data.html#fig1.4.2","level":"1.4","list_caption":"Figure: 图 2-2：一个事务，被视为一组资源。","alt":"图 2-2：一个事务，被视为一组资源。","nro":7,"url":"images/f2-2.png","index":2,"caption_template":"_CAPTION_","label":"图 2-2：一个事务，被视为一组资源。","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"the-value-of-structured-data.html#fig1.4.3","level":"1.4","list_caption":"Figure: 图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","alt":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","nro":8,"url":"images/f2-3.png","index":3,"caption_template":"_CAPTION_","label":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","attributes":{},"skip":false,"key":"1.4.3"},{"backlink":"the-value-of-structured-data.html#fig1.4.4","level":"1.4","list_caption":"Figure: 图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","alt":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","nro":9,"url":"images/f2-4.png","index":4,"caption_template":"_CAPTION_","label":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","attributes":{},"skip":false,"key":"1.4.4"},{"backlink":"architectural-overview.html#fig1.7.1","level":"1.7","list_caption":"Figure: 图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","alt":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","nro":10,"url":"images/f5-1.png","index":1,"caption_template":"_CAPTION_","label":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","attributes":{},"skip":false,"key":"1.7.1"},{"backlink":"architectural-overview.html#fig1.7.2","level":"1.7","list_caption":"Figure: 图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","alt":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","nro":11,"url":"images/f5-2.png","index":2,"caption_template":"_CAPTION_","label":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","attributes":{},"skip":false,"key":"1.7.2"},{"backlink":"architectural-overview.html#fig1.7.3","level":"1.7","list_caption":"Figure: 图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","alt":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","nro":12,"url":"images/f5-3.png","index":3,"caption_template":"_CAPTION_","label":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","attributes":{},"skip":false,"key":"1.7.3"},{"backlink":"stability-and-long-term-support.html#fig1.8.1","level":"1.8","list_caption":"Figure: 图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","alt":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","nro":13,"url":"images/f6-1.png","index":1,"caption_template":"_CAPTION_","label":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","attributes":{},"skip":false,"key":"1.8.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.1","level":"1.9","list_caption":"Figure: 图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","alt":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","nro":14,"url":"images/f7-1.png","index":1,"caption_template":"_CAPTION_","label":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","attributes":{},"skip":false,"key":"1.9.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.2","level":"1.9","list_caption":"Figure: 图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","alt":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","nro":15,"url":"images/f7-2.png","index":2,"caption_template":"_CAPTION_","label":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","attributes":{},"skip":false,"key":"1.9.2"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.3","level":"1.9","list_caption":"Figure: 图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","alt":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","nro":16,"url":"images/f7-3.png","index":3,"caption_template":"_CAPTION_","label":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","attributes":{},"skip":false,"key":"1.9.3"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.4","level":"1.9","list_caption":"Figure: 图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","alt":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","nro":17,"url":"images/f7-4.png","index":4,"caption_template":"_CAPTION_","label":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","attributes":{},"skip":false,"key":"1.9.4"}]},"title":"OpenTelemetry 可观测性的未来","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生社区":"https://cloudnative.to/"}},"gitbook":"*","description":"OpenTelemetry 可观察性的未来 | O'Reilly 报告"},"file":{"path":"supporting-open-source-and-native-instrumentation.md","mtime":"2022-02-06T03:51:06.790Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-02-06T03:51:32.949Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

