
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第 3 章：自动分析的局限性 · OpenTelemetry 可观测性的未来</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="【著】Ted Young，【译】Jimmy Song（宋净超）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="supporting-open-source-and-native-instrumentation.html" />
    
    
    <link rel="prev" href="the-value-of-structured-data.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/docs/" target="_blank" class="custom-link">云原生资料库</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="history.html">
            
                <a href="history.html">
            
                    
                    第 1 章：可观测性的历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="the-value-of-structured-data.html">
            
                <a href="the-value-of-structured-data.html">
            
                    
                    第 2 章：结构化数据的价值
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="the-limitations-of-automated-analysis.html">
            
                <a href="the-limitations-of-automated-analysis.html">
            
                    
                    第 3 章：自动分析的局限性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="supporting-open-source-and-native-instrumentation.html">
            
                <a href="supporting-open-source-and-native-instrumentation.html">
            
                    
                    第 4 章：支持开源和原生监测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="architectural-overview.html">
            
                <a href="architectural-overview.html">
            
                    
                    第 5 章：OpenTelemetry 架构概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="stability-and-long-term-support.html">
            
                <a href="stability-and-long-term-support.html">
            
                    
                    第 6 章：稳定和长期支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="suggested-setups-and-telemetry-pipelines.html">
            
                <a href="suggested-setups-and-telemetry-pipelines.html">
            
                    
                    第 7 章：建议的设置和遥测管道
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="roll-out.html">
            
                <a href="roll-out.html">
            
                    
                    第 8 章：如何在组织中推广 OpenTelemetry
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="organization.html">
            
                <a href="organization.html">
            
                    
                    附录 A：OpenTelemetry 项目组织
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="roadmap.html">
            
                <a href="roadmap.html">
            
                    
                    附录 B：OpenTelemetry 项目路线图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第 3 章：自动分析的局限性</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-3-&#x7AE0;&#xFF1A;&#x81EA;&#x52A8;&#x5206;&#x6790;&#x7684;&#x5C40;&#x9650;&#x6027;">&#x7B2C; 3 &#x7AE0;&#xFF1A;&#x81EA;&#x52A8;&#x5206;&#x6790;&#x7684;&#x5C40;&#x9650;&#x6027;</h1>
<p>&#x81EA;&#x52A8;&#x5316;&#x5F00;&#x59CB;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8981;&#x9762;&#x5BF9;&#x73B0;&#x5B9E;&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x5206;&#x6790;&#x4E0D;&#x80FD;&#x6BCF;&#x5929;&#x544A;&#x8BC9;&#x4F60;&#x7CFB;&#x7EDF;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x6216;&#x4E3A;&#x4F60;&#x4FEE;&#x590D;&#x5B83;&#x3002;&#x5B83;&#x53EA;&#x80FD;&#x4E3A;&#x4F60;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x60F3;&#x505C;&#x6B62;&#x5938;&#x8D5E;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x4E00;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x3002;&#x6211;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x56E0;&#x4E3A;&#x56F4;&#x7ED5;&#x7ED3;&#x5408;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x548C;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x4F1A;&#x6709;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x7092;&#x4F5C;&#x3002;&#x8FD9;&#x79CD;&#x7092;&#x4F5C;&#x5BFC;&#x81F4;&#x4E86;&#x60CA;&#x4EBA;&#x7684;&#x8BBA;&#x65AD;&#xFF0C;&#x5927;&#x610F;&#x662F;&#xFF1A;&quot;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x548C;&#x6839;&#x6E90;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x8BCA;&#x65AD;&#x95EE;&#x9898;&#xFF01;&quot; &#x548C; &quot;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x64CD;&#x4F5C;&#x5C06;&#x5B8C;&#x5168;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#xFF01;&quot;</p>
<h2 id="&#x8C28;&#x9632;&#x7092;&#x4F5C;">&#x8C28;&#x9632;&#x7092;&#x4F5C;</h2>
<p>&#x4E3A;&#x4E86;&#x6446;&#x8131;&#x6B64;&#x7C7B;&#x7092;&#x4F5C;&#xFF0C;&#x6211;&#x60F3;&#x660E;&#x786E;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x7C7B;&#x68A6;&#x5E7B;&#x822C;&#x7684;&#x8425;&#x9500;&#x4E3B;&#x5F20;<strong>&#x5E76;&#x4E0D;&#x662F;</strong>&#x6211;&#x6240;&#x5BA3;&#x79F0;&#x7684;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x5C06;&#x63D0;&#x4F9B;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x9884;&#x6D4B;&#x8BB8;&#x591A;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x6709;&#x5173;&#x7684;&#x4E3B;&#x5F20;&#x5927;&#x591A;&#x662F;&#x5938;&#x5927;&#x5176;&#x8BCD;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF1F;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x673A;&#x5668;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684; &quot;&#x95EE;&#x9898;&quot;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9A;&#x4E49;&#x4EC0;&#x4E48;&#x662F; &quot;&#x95EE;&#x9898;&quot; &#x9700;&#x8981;&#x4E00;&#x79CD;&#x4E3B;&#x89C2;&#x7684;&#x5206;&#x6790;&#x65B9;&#x5F0F;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x79CD;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0D;&#x80FD;&#x4EE5;&#x4EFB;&#x4F55;&#x7A0B;&#x5EA6;&#x7684;&#x51C6;&#x786E;&#x6027;&#x8FDB;&#x884C;&#x4E3B;&#x89C2;&#x51B3;&#x7B56;&#x3002;&#x673A;&#x5668;&#x5C06;&#x59CB;&#x7EC8;&#x7F3A;&#x4E4F;&#x8DB3;&#x591F;&#x7684;&#x80CC;&#x666F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8BE5;&#x7248;&#x672C;&#x964D;&#x4F4E;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x4E5F;&#x9690;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x671F;&#x671B;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x5305;&#x542B;&#x4E86;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x671F;&#x671B;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x6027;&#x80FD;&#x9000;&#x6B65;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x7C7B;&#x4F3C;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x4F46;&#x5728;<strong>&#x786E;&#x5B9A;&#x76F8;&#x5173;&#x5173;&#x7CFB;</strong>&#x548C;<strong>&#x786E;&#x5B9A;&#x6839;&#x672C;&#x539F;&#x56E0;</strong>&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x5DE8;&#x5927;&#x7684;&#x9E3F;&#x6C9F;&#x3002;&#x5F53;&#x4F60;&#x6709;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#xFF0C;&#x76F8;&#x5173;&#x6027;&#x662F;&#x4E00;&#x79CD;<strong>&#x5BA2;&#x89C2;&#x7684;&#x5206;&#x6790;</strong> &#x2014;&#x2014; &#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x6570;&#x5B57;&#x3002;&#x54EA;&#x4E9B;&#x76F8;&#x5173;&#x5173;&#x7CFB;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5E76;&#x8868;&#x660E;&#x771F;&#x6B63;&#x95EE;&#x9898;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x603B;&#x662F;&#x9700;&#x8981;<strong>&#x4E3B;&#x89C2;&#x7684;&#x5206;&#x6790;&#xFF0C;</strong>&#x5BF9;&#x6570;&#x636E;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x76F8;&#x5173;&#x5173;&#x7CFB;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;&#x6B63;&#x5982;&#x6770;&#x5F17;&#x91CC;&#x30FB;&#x674E;&#x6CE2;&#x65AF;&#x57FA;&#xFF08;Jeffrey Lebowski&#xFF09;&#x6240;&#x8BF4;&#xFF1A;&quot;&#x55EF;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4F60;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4F19;&#x8BA1;&#x3002;&quot;</p>
<h2 id="&#x795E;&#x5947;&#x7684;-aiops">&#x795E;&#x5947;&#x7684; AIOps</h2>
<p>&#x5728;&#x8C03;&#x67E5;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5206;&#x6790;&#x8D77;&#x4F5C;&#x7528;&#xFF1A;</p>
<ul>
<li>&#x5BA2;&#x89C2;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x57FA;&#x4E8E;&#x4E8B;&#x5B9E;&#x7684;&#x3001;&#x53EF;&#x8861;&#x91CF;&#x7684;&#x3001;&#x53EF;&#x89C2;&#x6D4B;&#x7684;&#x3002;</li>
<li>&#x4E3B;&#x89C2;&#x5206;&#x6790;&#xFF0C;&#x57FA;&#x4E8E;&#x89E3;&#x91CA;&#x3001;&#x89C2;&#x70B9;&#x548C;&#x5224;&#x65AD;&#x7684;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x4E8C;&#x5206;&#x6CD5; &#x2014;&#x2014; &#x5BA2;&#x89C2;&#x4E0E;&#x4E3B;&#x89C2;&#xFF0C;&#x4E0E;&#x53EF;&#x8BA1;&#x7B97;&#x6027;&#x7406;&#x8BBA;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x6709;&#x5173;&#xFF0C;&#x5373;<strong><a href="https://en.wikipedia.org/wiki/Halting_problem" target="_blank">&#x505C;&#x673A;&#x95EE;&#x9898;&#xFF08;halting problem&#xFF09;</a></strong>&#x3002;&#x505C;&#x673A;&#x95EE;&#x9898;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#xFF0C;&#x5728;&#x7ED9;&#x5B9A;&#x4EFB;&#x610F;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x53CA;&#x5176;&#x8F93;&#x5165;&#x7684;&#x63CF;&#x8FF0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x6765;&#x786E;&#x5B9A;&#x4EFB;&#x610F;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x4F1A;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x6216;&#x6C38;&#x8FDC;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5728; 1936 &#x5E74;&#xFF0C;&#x827E;&#x4F26;&#x30FB;&#x56FE;&#x7075;&#xFF08;Alan Turning&#xFF09;&#x8BC1;&#x660E;&#x4E86;&#x89E3;&#x51B3;&#x505C;&#x673A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x822C;&#x7B97;&#x6CD5;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BC1;&#x660E;&#x7684;&#x5EF6;&#x4F38;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x8F6F;&#x4EF6;&#x4E2D;&#x8BB8;&#x591A;&#x5F62;&#x5F0F;&#x7684;&#x8BC6;&#x522B; &quot;&#x95EE;&#x9898;&quot;&#x3002;</p>
<p>&#x963F;&#x5170;&#x30FB;&#x56FE;&#x7075;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x62E5;&#x6709;&#x795E;&#x5947;&#x7684; AIOps&#xFF08;IT &#x8FD0;&#x7EF4;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x3002;&#x5BFB;&#x627E;&#x90A3;&#x4E9B;&#x627F;&#x8BFA;&#x5C06;&#x7E41;&#x7410;&#x7684;&#x5BA2;&#x89C2;&#x5206;&#x6790;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x5DE5;&#x5177; &#x2014;&#x2014; &#x8BA1;&#x7B97;&#x6570;&#x5B57;&#x662F;&#x673A;&#x5668;&#x7684;&#x5F3A;&#x9879;&#xFF01;&#x4F46;&#x8981;&#x5C0F;&#x5FC3;&#x90A3;&#x4E9B;&#x58F0;&#x79F0;&#x80FD;&#x627E;&#x5230;&#x95EE;&#x9898;&#x6839;&#x6E90;&#x5E76;&#x81EA;&#x52A8;&#x4FEE;&#x590D;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x4EEC;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x5931;&#x671B;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x76F8;&#x5173;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF1A;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x4EFB;&#x610F;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x884C;&#x4E3A;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x8BE5;&#x884C;&#x4E3A;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x9020;&#x51FA;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5F00;&#x9999;&#x69DF;&#x7684;&#x65F6;&#x5019;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x7EC8;&#x4E8E;&#x89E3;&#x51B3;&#x4E86;&#x505C;&#x673A;&#x95EE;&#x9898;&#xFF01;&#x4F46;&#x662F;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x8FF9;&#x8C61;&#x8868;&#x660E;&#xFF0C;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6CA1;&#x6709;&#x8FF9;&#x8C61;&#x8868;&#x660E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x4E86;&#x827E;&#x4F26;&#x30FB;&#x56FE;&#x7075;&#x7684;&#x7EDF;&#x4E00;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#xFF1B;&#x4F60;&#x53EF;&#x4EE5;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x51B3;&#x5B9A;&#x548C;&#x4FEE;&#x590D;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x8981;&#x9760;&#x4F60;&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x662F;&#x6700;&#x5B9D;&#x8D35;&#x7684;&#x8D44;&#x6E90;">&#x65F6;&#x95F4;&#x662F;&#x6700;&#x5B9D;&#x8D35;&#x7684;&#x8D44;&#x6E90;</h2>
<p>&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x795E;&#x5947;&#x7684; AIOps &#x6765;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x7684;&#x5DE8;&#x5927;&#x6539;&#x5584;&#x3002;&#x8BC6;&#x522B;&#x76F8;&#x5173;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x83B7;&#x53D6;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F60;&#x80FD;&#x6709;&#x6548;&#x5730;&#x6D4F;&#x89C8;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x662F;&#x8BA1;&#x7B97;&#x673A;<strong>&#x7EDD;&#x5BF9;&#x53EF;&#x4EE5;</strong>&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF01;&#x8FD9;&#x5C06;&#x4E3A;&#x4F60;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x3002;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5B83;&#x5C06;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6539;&#x53D8;&#x4F60;&#x8C03;&#x67E5;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x51CF;&#x5C11;&#x6D6A;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x5B9E;&#x8DF5;&#x73B0;&#x4EE3;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x6570;&#x5B57;&#x6765;&#x8BC6;&#x522B;&#x76F8;&#x5173;&#x6027;&#x4E5F;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x800C;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x8F6C;&#x79FB;&#x5230;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x7BA1;&#x7406;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x4EBA;&#x7C7B;&#x5934;&#x8111;&#x6240;&#x80FD;&#x5BB9;&#x7EB3;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x9065;&#x6D4B;&#x65B9;&#x5F0F;&#x7684;&#x8FD9;&#x79CD;&#x8F6C;&#x53D8;&#x5E76;&#x4E0D;&#x662F;&#x53EF;&#x89C2;&#x6D4B;&#x6027;&#x4E16;&#x754C;&#x4E2D;&#x5373;&#x5C06;&#x53D1;&#x751F;&#x7684;&#x552F;&#x4E00;&#x91CD;&#x5927;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x5927;&#x90E8;&#x5206;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x6765;&#x81EA;&#x4E8E;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x7F16;&#x5199;&#x7684;&#x8F6F;&#x4EF6;&#xFF1A;&#x6211;&#x4EEC;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x5F00;&#x6E90;&#x5E93;&#x3001;&#x6570;&#x636E;&#x5E93;&#x548C;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x5728;&#x4F20;&#x7EDF;&#x4E0A;&#x4E00;&#x76F4;&#x5728;&#x4E3A;&#x4EA7;&#x751F;&#x9065;&#x6D4B;&#x6570;&#x636E;&#x800C;&#x594B;&#x6597;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6765;&#x81EA;&#x54EA;&#x91CC;&#xFF0C;&#x4E5F;&#x5C06;&#x53D1;&#x751F;&#x6839;&#x672C;&#x6027;&#x7684;&#x53D8;&#x5316;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | &#x57FA;&#x4E8E; <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC 4.0 &#x534F;&#x8BAE;</a> &#x53D1;&#x5E03; | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-05-19 02:22:14
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="the-value-of-structured-data.html" class="navigation navigation-prev " aria-label="Previous page: 第 2 章：结构化数据的价值">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="supporting-open-source-and-native-instrumentation.html" class="navigation navigation-next " aria-label="Next page: 第 4 章：支持开源和原生监测">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第 3 章：自动分析的局限性","level":"1.5","depth":1,"next":{"title":"第 4 章：支持开源和原生监测","level":"1.6","depth":1,"path":"supporting-open-source-and-native-instrumentation.md","ref":"supporting-open-source-and-native-instrumentation.md","articles":[]},"previous":{"title":"第 2 章：结构化数据的价值","level":"1.4","depth":1,"path":"the-value-of-structured-data.md","ref":"the-value-of-structured-data.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","lightbox","ga","sitemap-general","hide-element","insert-logo","adsense"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | 基于 <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC 4.0 协议</a> 发布 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/opentelemetry-obervability"},"editlink":{"base":"https://github.com/rootsongjc/opentelemetry-obervability/blob/main/","label":"编辑本页"},"splitter":{},"adsense":{"client":"ca-pub-4029167986768912","slot":"2445941692","format":"auto","element":".page-inner section","position":"bottom"},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/opentelemetry-obervability/"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/opentelemetry-obervability","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://jimmysong.io/images/logo-black-text.png"},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"【著】Ted Young，【译】Jimmy Song（宋净超）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"history.html#fig1.3.1","level":"1.3","list_caption":"Figure: 图 1-1：可观测性的 \"三大支柱\"。","alt":"图 1-1：可观测性的 \"三大支柱\"。","nro":1,"url":"images/f1-1.png","index":1,"caption_template":"_CAPTION_","label":"图 1-1：可观测性的 \"三大支柱\"。","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"history.html#fig1.3.2","level":"1.3","list_caption":"Figure: 图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","alt":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","nro":2,"url":"images/f1-2.png","index":2,"caption_template":"_CAPTION_","label":"图 1-2：传统上，寻找不同数据集之间的关联性是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"history.html#fig1.3.3","level":"1.3","list_caption":"Figure: 图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","alt":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","nro":3,"url":"images/f1-3.png","index":3,"caption_template":"_CAPTION_","label":"图 1-3：找到与异常情况相关的日志也是一种可怕的经历。","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"history.html#fig1.3.4","level":"1.3","list_caption":"Figure: 图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","alt":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","nro":4,"url":"images/f1-4.png","index":4,"caption_template":"_CAPTION_","label":"图 1-4：在传统的日志记录中，找到构成一个特定事务的确切日志需要花费大量的精力。如果系统变得足够大，这几乎成为不可能。","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"history.html#fig1.3.5","level":"1.3","list_caption":"Figure: 图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","alt":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","nro":5,"url":"images/f1-5.png","index":5,"caption_template":"_CAPTION_","label":"图 1-5：OpenTelemetry 将所有这些孤立的信息，作为一个单一的、高度结构化的数据流连接起来。","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"the-value-of-structured-data.html#fig1.4.1","level":"1.4","list_caption":"Figure: 图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","alt":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","nro":6,"url":"images/f2-1.png","index":1,"caption_template":"_CAPTION_","label":"图 2-1：虽然事件有一些特定的事件属性，但大多数属性属于事件发生的上下文之一。","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"the-value-of-structured-data.html#fig1.4.2","level":"1.4","list_caption":"Figure: 图 2-2：一个事务，被视为一组资源。","alt":"图 2-2：一个事务，被视为一组资源。","nro":7,"url":"images/f2-2.png","index":2,"caption_template":"_CAPTION_","label":"图 2-2：一个事务，被视为一组资源。","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"the-value-of-structured-data.html#fig1.4.3","level":"1.4","list_caption":"Figure: 图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","alt":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","nro":8,"url":"images/f2-3.png","index":3,"caption_template":"_CAPTION_","label":"图 2-3：当日志被组织成一个图形时，它们就变成了追踪。","attributes":{},"skip":false,"key":"1.4.3"},{"backlink":"the-value-of-structured-data.html#fig1.4.4","level":"1.4","list_caption":"Figure: 图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","alt":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","nro":9,"url":"images/f2-4.png","index":4,"caption_template":"_CAPTION_","label":"图 2-4：可能提供关键洞察力、指向根本原因的关联实例。","attributes":{},"skip":false,"key":"1.4.4"},{"backlink":"architectural-overview.html#fig1.7.1","level":"1.7","list_caption":"Figure: 图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","alt":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","nro":10,"url":"images/f5-1.png","index":1,"caption_template":"_CAPTION_","label":"图 5-1：所有 OpenTelemetry 信号都建立在一个共享的上下文传播系统之上。其他的，非可观测性的交叉关注也可以使用上下文传播机制来通过分布式系统传输他们的数据。","attributes":{},"skip":false,"key":"1.7.1"},{"backlink":"architectural-overview.html#fig1.7.2","level":"1.7","list_caption":"Figure: 图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","alt":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","nro":11,"url":"images/f5-2.png","index":2,"caption_template":"_CAPTION_","label":"图 5-2：OpenTelemetry 客户端架构。为了帮助管理依赖性，OpenTelemetry 将实现与仪表使用的 API 分开。","attributes":{},"skip":false,"key":"1.7.2"},{"backlink":"architectural-overview.html#fig1.7.3","level":"1.7","list_caption":"Figure: 图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","alt":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","nro":12,"url":"images/f5-3.png","index":3,"caption_template":"_CAPTION_","label":"图 5-3：收集器有一个可配置的处理管道，可以导入和导出许多常见格式的数据。","attributes":{},"skip":false,"key":"1.7.3"},{"backlink":"stability-and-long-term-support.html#fig1.8.1","level":"1.8","list_caption":"Figure: 图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","alt":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","nro":13,"url":"images/f6-1.png","index":1,"caption_template":"_CAPTION_","label":"图 6-1：OpenTelemetry 中的每个主要功能都被赋予了一个稳定性等级，并遵循相同的生命周期。","attributes":{},"skip":false,"key":"1.8.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.1","level":"1.9","list_caption":"Figure: 图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","alt":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","nro":14,"url":"images/f7-1.png","index":1,"caption_template":"_CAPTION_","label":"图 7-1：一个本地收集器（C）从本地应用程序（A）接收遥测数据，同时收集主机指标（H）。收集器将合并的遥测数据输出到管道的下一个阶段。","attributes":{},"skip":false,"key":"1.9.1"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.2","level":"1.9","list_caption":"Figure: 图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","alt":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","nro":15,"url":"images/f7-2.png","index":2,"caption_template":"_CAPTION_","label":"图 7-2：应用程序（A）可以通过使用路由器或负载均衡器向收集器（C）池发送遥测信息。","attributes":{},"skip":false,"key":"1.9.2"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.3","level":"1.9","list_caption":"Figure: 图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","alt":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","nro":16,"url":"images/f7-3.png","index":3,"caption_template":"_CAPTION_","label":"图 7-3：收集器可以帮助管理复杂的、拼凑的可观测性系统，这些系统以各种格式向各种存储系统发送数据。","attributes":{},"skip":false,"key":"1.9.3"},{"backlink":"suggested-setups-and-telemetry-pipelines.html#fig1.9.4","level":"1.9","list_caption":"Figure: 图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","alt":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","nro":17,"url":"images/f7-4.png","index":4,"caption_template":"_CAPTION_","label":"图 7-4：使用收集器在可观测性后端之间迁移而不中断服务。","attributes":{},"skip":false,"key":"1.9.4"}]},"title":"OpenTelemetry 可观测性的未来","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生资料库":"https://jimmysong.io/docs/"}},"gitbook":"*","description":"OpenTelemetry 可观察性的未来 | O'Reilly 报告"},"file":{"path":"the-limitations-of-automated-analysis.md","mtime":"2022-05-19T02:22:14.465Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-05-19T02:22:37.608Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-adsense/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

